[
  {
    "title": "TCS Research and Innovation Interview Experience for Researcher Role",
    "url": "https://www.geeksforgeeks.org/interview-experiences/tcs-research-and-innovation-interview-experience-for-researcher-role/",
    "content": "TCS Research and Innovation recruits researchers from tier-1 institutes, targeting both B.Tech and M.Tech students. The shortlisting process is primarily based on candidates’ research potential and domain expertise. During the application, we were asked to choose our preferred domain for the interview. I selected Deep Learning and AI as my primary area of interest. A total of 9 students from both B.Tech and M.Tech programs were shortlisted for the role, and I was fortunate to be one of them. \nRecruitment Process Overview\nResume Shortlisting\nTechnical + Managerial Interview \nHR\nRound 1: Resume Shortlisting\nAfter my resume was shortlisted, I proceeded to the following interview rounds:\nRound 2: Technical + Managerial Interview \nThe technical interview panel consisted of four senior-level scientists from TCS Research. The round commenced with a brief self-introduction, followed by a detailed discussion of my primary research project. I was asked to walk them through the complete pipeline, starting from dataset collection to selecting the most appropriate computational metrics for evaluating my model.\n1. Technical Questions\nHere are some key technical questions I was asked:\nWhat problem are you solving, and why do you believe it is important to address?\nCould you explain your dataset in detail? How did you handle high dimensionality in your dataset?\nWhat feature engineering techniques did you apply?\nHow did you handle missing values?\nWhy did you choose KNN imputation?\nHow can outliers be detected and treated effectively?\nExplain the concepts of box plots, standardization, and normalization. Why are these techniques necessary?\nWhich model did you choose and why?\nExplain how OPTUNA works in brief.\nWhat optimization algorithm did you use, and how does it function?\nWhen should one use R² score over accuracy, and vice versa?\nFollowing this, I was asked to elaborate on a particular feature of one of my personal NLP projects. I had to explain the complete pipeline in detail—highlighting each step, the choice of libraries, reasons for their selection over alternatives, and their impact on the overall time complexity.\n2. Managerial Round\nThe \nmanagerial round\n immediately followed the technical interview. During this round, I was asked questions to assess my interpersonal and decision-making skills, as well as my ability to thrive in a professional setting.\nSome of the questions I was asked included:\nHow do you justify your suitability for this role, competing against top-tier CSE/IT students?\nWhich research lab do you currently work in and under which professor?\nWhy aren't you working under a professor from the CSE department?\nIn the context of ML for medical applications, who do you think is better suited: someone from a non-core background like yours or someone with a biology background?\nSince machine learning was not a part of your formal coursework, how did you learn it and how credible are your sources of learning?\nAre you open to relocation, if required?\nDo you have any questions for us?\nThese questions gave me an opportunity to express my passion for research and how my diverse background contributed to my growth in the field of Machine Learning and AI.\nRound 3: \nHR Round\nThe HR round was quite relaxed. I was asked general questions related to my background, academic journey, and CGPA.\nVerdict : Selected\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nOakridge IT Solutions Interview Experience For a Market Research Firm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nAnonymous\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nTCS\n\n\n\n\n\n\nExperiences-QnA\n\n\n \n\n\n\n\n\n\nPractice Tags : \n\n\n\n\nTCS",
    "source": "GeeksforGeeks",
    "company": "TCS Research and Innovation",
    "role": "Researcher",
    "rounds": [
      "Technical",
      "HR",
      "Managerial"
    ],
    "difficulty": "",
    "question_count": 18,
    "raw_questions": [
      "What problem are you solving, and why do you believe it is important to address?",
      "Could you explain your dataset in detail? How did you handle high dimensionality in your dataset?",
      "What feature engineering techniques did you apply?",
      "How did you handle missing values?",
      "Why did you choose KNN imputation?",
      "How can outliers be detected and treated effectively?",
      "Explain the concepts of box plots, standardization, and normalization. Why are these techniques necessary?",
      "Which model did you choose and why?",
      "What optimization algorithm did you use, and how does it function?",
      "When should one use R² score over accuracy, and vice versa?",
      "How do you justify your suitability for this role, competing against top-tier CSE/IT students?",
      "Which research lab do you currently work in and under which professor?",
      "Why aren't you working under a professor from the CSE department?",
      "In the context of ML for medical applications, who do you think is better suited: someone from a non-core background like yours or someone with a biology background?",
      "Since machine learning was not a part of your formal coursework, how did you learn it and how credible are your sources of learning?",
      "Are you open to relocation, if required?",
      "Do you have any questions for us?"
    ]
  },
  {
    "title": "ZopSmart Interview Experience for SDE Intern",
    "url": "https://www.geeksforgeeks.org/interview-experiences/zopsmart-interview-experience-for-sde-intern/",
    "content": "Recently, I had the opportunity to interview for a Software Development Engineer (SDE) internship with ZopSmart, a retail tech company known for providing digital transformation solutions. The hiring process was intensive and structured across multiple rounds, thoroughly evaluating both technical skills and soft skills. Here's a detailed breakdown of my experience:\nHow I Received the Interview Call?\nI received the interview opportunity through on-campus recruitment at Chandigarh University. ZopSmart opened the SDE internship role to eligible students, attracting over 1700 applicants. The selection process was extremely competitive, with only 5 candidates making it through all the rounds.\nRecruitment Process Overview\nOnline Assessment 1\nOnline Assessment 2 \nGroup Discussion (GD)\nTechnical Interview 1\nTechnical Interview 2\nHR Interview\nRound 1: Online Assessment (OA - Screening)\nDuration\n: 1 hour\nMethod:\n Online (automated test)\nThis was the initial screening round. It comprised two easy-level problems focused on \nstring manipulation\n and \nlogic building\n. The questions were direct but required clarity in basic string operations and programming logic.\nOutcome:\n Top 200 candidates selected from 1700+ applicants\nRound 2: Online Assessment (OA - Elimination)\nDuration:\n 1 hour\nMethod\n: Online\nThe second round was more challenging, emphasizing \nmathematical logic\n and \nproblem-solving\n. It featured two medium-level problems involving \nmath-based algorithms\n, requiring strong analytical thinking and accuracy.\nOutcome:\n Shortlisted 40 candidates for further rounds\nRound 3: Group Discussion (GD)\nTopic\n: Should freshers say yes to every task given to them?\nDuration\n: 30 minutes\nThis round aimed to assess \ncommunication skills\n, \nclarity of thought\n, and \nconfidence\n in a group setting. The key challenge was balancing assertiveness with humility in a room full of competitive candidates.\nOutcome\n: 20–25 candidates moved forward\nRound 4: Technical Interview 1\nDuration\n: 25-30 minutes\nMode\n: In-person/Video\nThe first technical interview evaluated candidates on \nCore Java\n, \nSQL\n, and \nData Structures\n.\nDiscussion Topics:\nObject-Oriented Programming (OOP) concepts in Java\nSQL queries involving joins\nCoding Problem: \nPrint the right view of a binary tree\nChallenge:\n Properly handling edge cases in tree traversal logic\nOutcome\n: 10–15 candidates moved forward\nRound 5: Technical Interview 2\nDuration\n: 30-40 minutes\nThis round went deeper into \nproject experience\n, \nadvanced SQL\n, and \nDSA\n.\nDiscussion Topics:\nDetailed walk-through of a personal project, covering design, challenges, and outcomes\nAdvanced SQL: joins, sub-queries, filtering\nCoding Problem: \nReverse Linked List in Variable-Sized Groups\n(first group - 1st node, second group - next 2 nodes, and so on…)\nChallenge:\n Handling group-wise iteration and pointer manipulation effectively\nOutcome:\n 7–8 candidates were shortlisted for the final HR round.\nRound 6: HR Round\nDuration: \n10 minutes\nThis final round assessed \npersonality\n and \nsoft skills\n.\nDiscussion Topics:\nSelf-introduction\nHobbies, strengths, and weaknesses\nMotivation for joining ZopSmart\nOutcome:\n 5 candidates, including myself, were selected for the SDE Internship offer.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nThoughtspot Interview Experience for SDE Intern\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nAnonymous\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n2\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nExperiences-QnA",
    "source": "GeeksforGeeks",
    "company": "ZopSmart",
    "role": "SDE Intern",
    "rounds": [
      "Online Assessment",
      "Technical",
      "HR",
      "Coding"
    ],
    "difficulty": "Easy",
    "question_count": 2,
    "raw_questions": [
      "How I Received the Interview Call?",
      ": Should freshers say yes to every task given to them?",
      "SQL",
      "SQL queries involving joins"
    ]
  },
  {
    "title": "TCS Ninja Interview Experience",
    "url": "https://www.geeksforgeeks.org/interview-experiences/tcs-ninja-interview-experience-1/",
    "content": "As a final-year student based in Pune, Maharashtra, I had the exciting opportunity to participate in the TCS Ninja interview process in May 2025. This interview was crucial for my career, and I prepared diligently for each stage. Here’s a breakdown of my experience during the interview process and the lessons I learned along the way.\nRecruitment Overview Process\nThe TCS recruitment  process was divided into four main rounds:\nInitial Screening\nTechnical Round\nManagerial Round\nHR Round\nEach round had a specific focus, testing different skills and attributes required for the role. Let me take you through each of these rounds in detail.\nRound 1: Initial Screening\nDuration\n: 190 mins\nMethod\n: Online Aptitude and Coding Assessment\nFocus\n: General aptitude, reasoning, and basic coding\nThe first stage of the interview was the online assessment, which included two main parts: \naptitude\n and \ncoding\n. The assessment aimed to evaluate my problem-solving ability, speed, and coding proficiency. Here's what I encountered:\n1.1 Aptitude Section:\nThe aptitude questions covered fundamental topics such as:\nTime, speed & distance\nProfit & loss\nNumber series\nThese topics required a strong understanding of mathematics and logic. I spent a considerable amount of time practicing these questions to improve my problem-solving speed and accuracy.\n1.2 Coding Section:\nIn the coding part, the questions focused on:\nPattern printing\nBasic recursion-based logic\nI had to implement solutions for pattern printing and solve simple recursive problems. These questions were designed to test my ability to think algorithmically and write clean code under time pressure.\nRound 2: Technical Round\nDuration:\n 45 minutes\nMethod:\n Offline Interview\nFocus\n: Projects, core CS concepts, and technology stack used\nAfter successfully clearing the initial screening, I moved on to the \nTechnical Round\n. This was an offline interview that delved into my projects and core computer science concepts. The interview was interactive and covered the following topics:\nBasic Questions:\nIntroduce yourself\nExplain your major and minor projects\nFollow-up questions on project flow, tech stack, and challenges faced\nTechnologies used in projects: Frameworks, databases, version control\nTechnical Concepts:\nOOPs Concepts: Polymorphism, Inheritance, Encapsulation\nExplain Abstraction with a real-life example\nDifferences between public, private, and protected access specifiers\nRole of the friend keyword in C++\nBasics of views, indexes, and stored procedures in SQL\nThis round tested not only my technical knowledge but also how well I could communicate complex topics and solutions.\nRound 3: Managerial Round\nDuration\n: 30 minutes\nMethod\n: Offline Interview\nFocus\n: Problem-solving ability, personality traits, resume-based discussion\nThe \nManagerial Round\n was designed to assess my problem-solving ability, personality, and how I would fit into the company culture. Here, I faced a mix of technical and personal questions:\nKey Questions:\nWrite a code to calculate factorial of a number\nDiscuss your hobbies and how you pursue them\nWhat certifications have you done? (Asked about relevance to job role)\nDeep dive into some bullet points from the resume\nRound 4: HR \nDuration\n: 15 minutes\nMethod\n: Offline Interview\nFocus\n: Cultural fit, job flexibility, and expectations\nFinally, I entered the \nHR Round\n, which was more about cultural fit and understanding my expectations for the role. The HR interviewer asked a few basic but important questions:\nKey Questions:\nWhere is your hometown?\nAre you okay with relocation?\nAre you comfortable working night shifts?\nAre you genuinely interested in joining TCS?\nFinal Outcome\nI gave the TCS Ninja interview after thoroughly preparing the basics of computer science fundamentals, SQL, and the technologies mentioned in my resume. This focused preparation really helped me tackle both the technical and managerial rounds with confidence. The interviewers were supportive throughout the process. In the HR round, after a brief discussion, I was delighted to hear the words, \n\"You are selected for the interview.\"\n It was a memorable and rewarding experience.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nTCS Ninja Interview Experience (2019)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJ\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\njayashris8ar\n \n\n\n\n\n\n\n\n\n\n\n\n\n \nFollow\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nTCS-Ninja",
    "source": "GeeksforGeeks",
    "company": "TCS Ninja",
    "role": "",
    "rounds": [
      "Online Assessment",
      "Technical",
      "HR",
      "Managerial",
      "Coding",
      "Aptitude"
    ],
    "difficulty": "",
    "question_count": 7,
    "raw_questions": [
      "Key Questions:",
      "What certifications have you done? (Asked about relevance to job role)",
      "Key Questions:",
      "Where is your hometown?",
      "Are you okay with relocation?",
      "Are you comfortable working night shifts?",
      "Are you genuinely interested in joining TCS?"
    ]
  },
  {
    "title": "Goldman Sachs Interview Experience for Strats Associate",
    "url": "https://www.geeksforgeeks.org/interview-experiences/goldman-sachs-interview-experience-for-strats-associate/",
    "content": "I recently interviewed for the \nStrats role\n in the \nAWM Strats\n department at \nGoldman Sachs\n. The interview process was rigorous and consisted of multiple rounds, each focusing on different aspects of my technical and behavioural skills. Although I was ultimately rejected, the experience provided invaluable insights and helped me grow both professionally and personally.\nRecruitment Process Overview\nInitial Screening: Exploratory Round\nCoding Round\nTechnical Round I\nTechnical Round II\nRound 1: Initial Screening: Exploratory Round\nThe first round was an exploratory call that lasted around \n30 minutes\n via \nvideo call\n. This round was more about understanding my future aspirations and whether I would be a good fit for the role.\nKey Questions\nIntroduce yourself and explain your background.\nWhat are your future goals, and why are you targeting the Strats role?\nWhy Goldman Sachs and what interests you about this department?\nObstacles:\n No obstacle as such, cleared the round smoothly.\nRound 2: Coding Round\nThe \nCoding round\n lasted \n1 hour\n and was conducted via \nvideo call\n. This round was focused on problem-solving and testing my Data Structures and Algorithms (DSA) knowledge.\nKey Questions\nChessboard Problem:\nThe question asked about a bishop on an 8x8 chessboard. I was given the starting and target coordinates and had to find the minimum number of moves for the bishop to reach the target. If it was impossible, I needed to return -1.\nAfter some brainstorming, I identified the pattern and solved it successfully, passing all test cases within \n30 minutes\n.\nTrapping Rainwater Problem:\nI skipped the brute force approach and quickly suggested using the \nprefix and suffix array approach\n to solve this problem. However, due to time constraints, I was unable to implement the solution completely.\nObstacles\n: I touched DSA last in December 2022, so I was a bit slow and underprepared for the interview, I was even facing difficulty in the syntax but the interviewer understood and helped me a bit with cpp syntax.\nRound 3: Technical Round I\nThe \nTechnical Round I\n lasted for \n1 hour\n and was conducted via \nvideo call\n. This round was a \npanel interview\n with two interviewers. The questions started off easy but progressively became more challenging.\n \nKey Questions\nPuzzle Question:\nThe interview started with a \npuzzle\n (\nhttps://www.geeksforgeeks.org/puzzle-18-torch-and-bridge/\n), which I struggled to solve. I was moving in the right direction but couldn’t finish in time.\nReverse a Number:\nThe interviewers asked me to reverse a number, a basic question. I explained my approach and coded the solution. We discussed edge cases like integer overflow, and I explained how I would handle those cases.\nArithmetic Progression in an Array:\nI was asked how to check if an array's elements form an \nArithmetic Progression\n. I initially suggested sorting the array and checking the difference between consecutive elements. The interviewer asked me to optimize it, and I came up with a \nHashmap approach\n which they were satisfied with.\nObstacles\n: I faced minor lags because I had lost touch with coding from sometime. Also, not able to solve puzzle caused a bit of panic to me.\nRound 4: Technical Round II\nThis round took place just \n15 minutes\n after the previous one, making it a bit challenging to recover fully. The round lasted \n1 hour\n and was again conducted via \nvideo call\n.\nKey Questions\nRemove Consecutive Characters from String:\nI was asked to solve the problem where consecutive characters in a string need to be removed. I first provided the \nbrute force solution\n and then optimized it using a \nstack\n approach. The solution passed all test cases.\nSquare Root of a Decimal to 4 Decimal Places:\nThe second question was about finding the \nsquare root of a decimal\n to \n4 decimal places\n. I proposed the \nbinary search approach\n, but I struggled to handle the precision for four decimal places in the code. The interviewer acknowledged my thought process but noted that I needed to improve on implementing it within the time frame.\nObstacles\n: The second question was a bit googly for me and I was stuck due to that 4 decimal place criteria.\nVerdict: Rejected\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nGoldman Sachs Interview Experience | Set 5\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nAnonymous\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n2\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nExperiences\n\n\n\n\n\n\nGoldman Sachs\n\n\n\n\n\n\nExperiences-QnA\n\n\n \n\n\n\n\n\n\nPractice Tags : \n\n\n\n\nGoldman Sachs",
    "source": "GeeksforGeeks",
    "company": "Goldman Sachs",
    "role": "Strats Associate",
    "rounds": [
      "Technical",
      "Coding"
    ],
    "difficulty": "Hard",
    "question_count": 9,
    "raw_questions": [
      "Key Questions",
      "What are your future goals, and why are you targeting the Strats role?",
      "Why Goldman Sachs and what interests you about this department?",
      "Key Questions",
      "Key Questions",
      "Key Questions"
    ]
  },
  {
    "title": "Dentsu  Interview Experience for Associate Business Analyst (Intern)",
    "url": "https://www.geeksforgeeks.org/interview-experiences/dentsu-interview-experience-for-associate-business-analyst-intern/",
    "content": "After applying, I received an email from Dentsu’s HR team within 3 days, notifying me that my resume had been shortlisted. The email contained further details about the internship and the interview process. The selection process consisted of four rounds and was completed within 1 week. All the interviews were conducted virtually.\nRecruitment Overview Process\nAptitude Assessment\nJombay Behavioural Assessment\nArticulation Round\nHR Round\nRound 1: Aptitude Assessment\nThe first assessment link was shared via email the next day.\nDuration:\n 40 minutes\nQuestions\n: 25 aptitude-based questions\nDifficulty\n: Easy to moderate\nParticipants\n: 800+ candidates\nOutcome:\n I cleared this round comfortably.\nRound 2:\n Jombay Behavioural Assessment\nThe next day, I received a link for the second assessment.\nType:\n Behavioural test (situation-based questions)\nQuestions\n: Around 100\nFocus: \nPersonality, decision-making, ethics\nShortlisted Candidates:\n Reduced to about 200 after this round\nOutcome\n: I cleared this round as well.\nRound 3: Articulation Round\nThis was the most interesting round. I attended it two days later.\nThe HR was \nextremely polite, friendly\n, and made everyone feel at ease.\nShe introduced herself and explained the company’s vision and values.\nQuestions asked included:\nWho is your favourite pet and why?\nDo miracles happen around us?\nYour thoughts on social media and long-distance relationships.\nEssay-style prompts similar to school English papers.\nPreferences for location and specialization.\nTips:\nAlso be ready for guesstimate and puzzle-based questions, such as:\nHow many people in your city use iPhones?\nHow many people in India wear a red cap?\nImportant Note:\nStudents from Computer Science Engineering backgrounds were disqualified at this stage. The HR clearly stated they were not eligible. (Luckily, I'm from Artificial Intelligence and Data Science, so I was eligible.)\nTotal candidates left: About 50\nAttended this round: Only 34\nRound 4: HR\nThis round was conversational and relaxed.\nQuestions included:\nTell me about yourself\nHow does this role fit your background?\nWhere do you see yourself in 3–5 years?\nWhat are your strengths and weaknesses?\nA few simple scenario-based questions\nNote\n: This opportunity is strictly for freshers, not for experienced professionals.\nFinal Outcome\nOverall, I’m very satisfied with the way Dentsu handled the hiring process. It was professional yet friendly, well-organized yet informal in tone, which really helped reduce the pressure. I'm grateful for the opportunity and hopeful for the outcome. I was selected.\nPost-Interview Reflections:\nThe entire screening process was very smooth, well-structured, and stress-free.\nI really appreciated how kind and supportive the HRs were at every stage.\nAs this was my first-ever interview, I was nervous initially, but the positive environment helped me stay confident.\nMy Advice:\nBe honest in your responses and resume.\nDon’t over-prepare or fake confidence—just be yourself.\nPrepare for basic behavioral, logical, and articulation-based questions.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nDeloitte Interview Experience For Associate Analyst (On-Campus)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nAnonymous\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nExperiences-QnA",
    "source": "GeeksforGeeks",
    "company": "Dentsu",
    "role": "Associate Business Analyst (Intern)",
    "rounds": [
      "HR",
      "Aptitude"
    ],
    "difficulty": "Hard",
    "question_count": 7,
    "raw_questions": [
      "Who is your favourite pet and why?",
      "Do miracles happen around us?",
      "How many people in your city use iPhones?",
      "How many people in India wear a red cap?",
      "How does this role fit your background?",
      "Where do you see yourself in 3–5 years?",
      "What are your strengths and weaknesses?"
    ]
  },
  {
    "title": "Cognizant Interview Experience - GENC Next Role - 2025",
    "url": "https://www.geeksforgeeks.org/interview-experiences/cognizant-interview-experience-genc-next-role-2025/",
    "content": "This is about my recent interview experience with Cognizant, which is a pool campus drive in February; 2025. The recruitment process was well-structured and consisted of four rounds: a Versant Test, an Aptitude + Reasoning (Game-Based) Round, a Technical Assessment, and finally a combined Technical + HR Interview.\nRecruitment Process Overview\nThe Cognizant recruitment process had 4 rounds:\nVersant Test\nAptitude + Reasoning (Game-Based Assessment)\nTechnical Assessment\nTechnical + HR Interview \nRound 1: Versant Test\nVersant Test\n is conducted through AMCAT \nDuration:\n 60 minutes\nThe Versant Test is designed to evaluate a candidate's spoken  English Communication skills, which are crucial for roles involving client interaction and global collaboration. This was an automated voice-based assessment, where candidates interact with a computer-generated voice.\nRound 2: Aptitude + Reasoning (Game-Based Assessment)\nMode:\n Online\nDuration\n: 80 minutes\nPlatform:\n AMCAT \nThis round was a game-based cognitive ability assessment designed to measure a candidate's mental agility, decision-making speed, and logical reasoning through a serios of interactive games. \nTips:\nNo need for prior practice; it's about being focused, quick, and accurate.\nRead instructions carefully before each game starts.\nStay calm, as the games can be fast-paced but intuitive.\nGood hand-eye coordination and presence of mind will help.\nRound 3: Technical Assessment\nMode\n: Online\nDuration:\n 120 minutes\nPlatform\n: AMCAT\n \nSection 1: SQL (2 Questions)\nThis section tested your ability to write and understand SQL queries.\nQuestions included:\nWriting queries using JOIN, GROUP BY, WHERE, and aggregate functions.\nUnderstanding query output or optimizing SQL logic.\nTip\n: Be thorough with INNER JOIN, LEFT JOIN, subqueries, and basic database concepts like normalization and keys.\nSection 2: Programming (2 Questions)\nCandidates could choose their preferred language from \nC#, Java\n, or \nPython.\nThe questions tested logical thinking, problem-solving, and code efficiency.\nCommon topics:\nString manipulation, \narrays/lists, loops, conditionals\nFunctions and basic \nobject-oriented programming\nSample problems - Palindrome check, sorting, pattern printing, frequency count\nTip:\n Practice medium-level coding questions and be comfortable using functions, loops, and built-in methods in your chosen language.\nSection 3: Web Development (1 Question)\nThis section had one question focused on basic front-end web technologies.\nTopics included:\nWriting\n HTML/CSS\n code to create or style a given layout\nUnderstanding of tags, form elements, CSS properties\nSometimes basic JavaScript logic (optional)\nTip: \nBrush up on HTML5 tags, CSS basics (positioning, flexbox, colors), and simple form handling.\n \nPreparation Tips\nPractice SQL queries on platforms like GFG - \nSQL Concept and Queries\n.\nStrengthen programming logic in your chosen language.\nReview basic front-end development (HTML/CSS) using interactive platforms like \nWeb Development\n - GFG\nRound 4: Technical + HR Interview\nMode: \nHybrid\nDuration:\n 90 minutes\nThis final round was a combination of technical and HR evaluation, conducted by two technical interviewers—one interacted with me in person, while the other joined virtually via the Superset platform. Both panelists were friendly and supportive, which helped ease the tension and allowed for smooth interaction.\nTechnical Evaluation:\nThe interviewers thoroughly assessed my understanding of core computer science concepts, programming, and real-world application knowledge.\nTopics Covered:\nObject-Oriented Programming (OOPs):\nConcepts like inheritance, polymorphism, encapsulation, abstraction\nReal-life examples and how OOPs applies in projects\nDBMS & SQL\n:\nSQL queries (JOINS, GROUP BY, aggregate functions)\nNormalization forms and use cases\nRelational schema and ER to table conversion\nBasic DSA (Data Structures & Algorithms):\nArrays, strings, and basic sorting/searching logic\nTime complexity-related discussions\nCoding Section:\nI was asked to write 4 coding problems during the interview. These were mostly:\nBased on strings and arrays\nInvolved logic building using OOPs concepts\nSome problems required SQL query writing as well\nThe coding was done live, and I was expected to explain the logic, optimize if possible, and handle edge cases.\nFinal Outcome\nAfter successfully clearing all four rounds, I was finally selected for the Programmer Analyst role at Cognizant. The results were announced nearly a month after the interview process concluded, and interestingly, they were declared after the results for the GenC profile were released.\nOverall, the process was well-structured, smooth, and candidate-friendly. The interviewers were approachable and supportive, especially during the final round, which made the experience less stressful and more conversational.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nCognizant GenC Next Interview Experience 2022\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nAnonymous\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nCognizant GenC\n\n\n\n\n\n\nExperiences-QnA",
    "source": "GeeksforGeeks",
    "company": "Cognizant",
    "role": "",
    "rounds": [
      "Technical",
      "HR",
      "Coding",
      "Aptitude"
    ],
    "difficulty": "Medium",
    "question_count": 0,
    "raw_questions": [
      "SQL Concept and Queries",
      "SQL queries (JOINS, GROUP BY, aggregate functions)"
    ]
  },
  {
    "title": "iBirds Software Services Interview Experience for Fresher 2025 {Off-Campus Interview Experience}",
    "url": "https://www.geeksforgeeks.org/interview-experiences/ibirds-software-services-interview-experience-for-fresher-2025-off-campus-interview-experience/",
    "content": "Hey everyone! I recently appeared for the iBirds Software Services off-campus drive on May 30th, and I wanted to share my experience here. The drive had around 127 candidates, and by the end, only 15 students were selected. I was fortunate to be one of them and secured a Java Developer Intern role. Though the process was challenging, I learned a lot and hope this post helps someone preparing for it in the future.\nRecruitment Process Overview:\nAptitude Round\nCoding Round\nTechnical Interview\nDirector Round\nRound 1: Aptitude Round\nThis was the first filtration round.\n1. Total Questions: 60\n30 Java MCQs:\n Focused on core Java and advanced Java concepts\n30 Basic Mathematics:\n Quantitative aptitude, qualitative aptitude, abstract reasoning, and logical reasoning\n2. Duration:\n 60 minutes\n3. Level: \nModerate\n4. Shortlisted Candidates: \n92 from 127\nOutcome:\n I was one of the 92 candidates who cleared this round. The questions were manageable if you have a good grasp of Java fundamentals and basic math skills.\nRound 2: Coding Round\nThis was a coding round with 3 sets of questions, each containing 4 questions. I got Set 2.\nMy Set (Set 2) Questions:\nLongest Palindromic Substring - DP Question\nBest Time to Buy and Sell Stocks II - Array Question\nReverse Nodes in K-Group - Recursion + LinkedList (only the function was implemented to test logic building)\nMy friends got set 1 and set 3 , which i menmtioned below\nSet 1 Questions:\nMinimum Window Substring - String Question\nTwo Sum - Array Question\nSearch in BST - Tree Question\nSet 3 Questions:\nReverse String and Find the Longest Substring - String Question\n\n\nC++\n\n\n\n\nPattern\n \nQuestion\n:\n\n\n1\n\n\n2\n \n1\n \n2\n\n\n3\n \n2\n \n1\n \n2\n \n3\n\n\n4\n \n3\n \n2\n \n1\n \n2\n \n3\n \n4\n\n\n5\n \n4\n \n3\n \n2\n \n1\n \n2\n \n3\n \n4\n \n5\n\n\n6\n \n5\n \n4\n \n3\n \n2\n \n1\n \n2\n \n3\n \n4\n \n5\n \n6\n\n\n\n\n \nPattern\n \nQuestion\n:\n1\n2\n \n1\n \n2\n3\n \n2\n \n1\n \n2\n \n3\n4\n \n3\n \n2\n \n1\n \n2\n \n3\n \n4\n5\n \n4\n \n3\n \n2\n \n1\n \n2\n \n3\n \n4\n \n5\n6\n \n5\n \n4\n \n3\n \n2\n \n1\n \n2\n \n3\n \n4\n \n5\n \n6\nPlus One in Array - Array Question\nShortlisted Candidates:\n 45 from 92\nOutcome: \nI was among the 45 shortlisted for the next round. The questions in Set 2 were of medium difficulty, and practicing DP, arrays, and linked lists beforehand really helped.\nRound 3: Technical Interview\nThis round was a face-to-face technical interview.\nTopics Covered:\nCore Java and Advanced Java concepts\nBasic SQL Queries\nOOPS Concepts\nDSA Question: Count the size of elements in an array\nFirst, I gave a brute force solution\nThen, I was asked to optimize it, and I provided an optimized approach using a HashMap\nShortlisted Candidates:\n 20 from 45\nOutcome:\n I cleared this round as well. The interviewer was friendly and focused on testing my problem-solving approach and clarity in explaining concepts.\nRound 4: Director Round\nThis was the final face-to-face round with the director. It was more about assessing communication, confidence, and fit for the role.\nShortlisted Candidates:\n 15 from 20\nOutcome:\n I was one of the 15 candidates who cleared this round and got selected for the Java Developer Intern role at iBirds Software Services!\nAdditional Tips\nPrepare well for Java:\n Both core and advanced Java are crucial.\nPractice DSA thoroughly:\n Focus on arrays, linked lists, and dynamic programming.\nGet comfortable with SQL:\n Basic queries are often asked in technical interviews.\nStay calm and confident:\n Even if you struggle, your approach and attitude matter.\nFinal Outcome\nI’m thrilled to share that I secured the Java Developer Intern role at iBirds Software Services! The process was challenging but rewarding, and I’m excited to start this new journey. To anyone preparing for iBirds, focus on your fundamentals and problem-solving skills — it’ll definitely pay off.\nBest of luck — keep learning and growing!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nHarman Connected Services Interview Experience for Software Engineer | Off-Campus 2021\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nAnonymous\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n2\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nExperiences-QnA",
    "source": "GeeksforGeeks",
    "company": "iBirds Software Services",
    "role": "Fresher 2025",
    "rounds": [
      "Technical",
      "Coding",
      "Aptitude"
    ],
    "difficulty": "Medium",
    "question_count": 1,
    "raw_questions": [
      "Quantitative aptitude, qualitative aptitude, abstract reasoning, and logical reasoning",
      "Question",
      "Question",
      "DSA Question: Count the size of elements in an array"
    ]
  },
  {
    "title": "My TCS Prime Interview Experience – 9 LPA Offer",
    "url": "https://www.geeksforgeeks.org/interview-experiences/my-tcs-prime-interview-experience-9-lpa-offer/",
    "content": "Tata Consultancy Services (TCS) has selected candidates for the TCS Prime profile, offering an impressive package of 9 LPA, although those selected for the Ninja profile will receive a package of 3.33 LPA. This recruitment is taking place at Lovely Professional University for the 2025 batch. The TCS NQT exam is scheduled for October 2024, and the interview process will take place on 4th December 2024. This on-campus recruitment provides students with a valuable opportunity to join one of the world’s leading IT services companies.\nHow I Got the Interview Call\nI registered for the TCS NQT (National Qualifier Test) through my college’s campus placement cell. After taking the test in October 2024, I was shortlisted for the TCS Prime interview round based on my performance, especially in the coding section, where I solved both questions.\nRounds of Selection\nTCS NQT (Written Test)\nSingle Technical + Managerial + HR Interview (All combined in one) This test was conducted at a TCS iON center.\nRound 1: TCS NQT (Written Test)\nThe test was divided into the following sections:\n1.1 Aptitude & Reasoning\nVerbal Ability\n1.2 Coding Questions\nFind the average of elements in an array.\nAnother medium-level array problem.\nObstacles:\n I was able to solve both questions within the time limit.\nRound 2: Interview (1 Hour | Panel of 3)\n1. Introduction\nThe panel started by asking me to introduce myself.\nI shared details about my background, technical skills, and projects.\n2. Technical Round\nThey asked me to solve the same coding question from the NQT test:\nFind the average of elements in an array.\nFollow-up questions:\nWhat is an average?\nWrite the code and explain it line-by-line.\n3. Project Discussion\nI explained my major project in detail.\nTech used - Cloud services, backend APIs, database integration.\nFollow-up Questions:\nWhat is Cloud Computing?\nWhy do we need cloud platforms?\nReal-world use cases of cloud technology.\n4. AI/ML Basics\nWhat is Artificial Intelligence?\nWhat is Machine Learning?\nExamples of ML applications (e.g., recommendation systems, fraud detection).\n5. HR Questions\nWhy is your CGPA low?\nHow do you stay self-motivated despite setbacks?\nWhat’s the difference between TCS Ninja, Digital, and Prime?\nIf selected for TCS Ninja, would you still join?\nFinal Result\nThough I was interviewed for the Prime role (9 LPA), I was finally offered the TCS Ninja role (3.33 LPA). Still, it was a great experience and boosted my confidence.\nTips for Aspirants\nRevise the coding questions you solved in NQT — you may be asked to explain them again.\nKnow your projects thoroughly — be ready to explain every tech stack used.\nPrepare basics of Cloud Computing, AI, and ML.\nBe ready to answer HR questions sincerely — especially about CGPA and role preference.\nStay confident, calm, and structured in your responses.\nKeep preparing and don’t lose heart — every interview is a stepping stone to something better. All the best! \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nTCS Prime Interview Experience\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nAnonymous\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n2\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nTCS\n\n\n\n\n\n\nExperiences-QnA\n\n\n \n\n\n\n\n\n\nPractice Tags : \n\n\n\n\nTCS",
    "source": "GeeksforGeeks",
    "company": "My TCS Prime",
    "role": "",
    "rounds": [
      "Technical",
      "HR",
      "Managerial",
      "Coding",
      "Aptitude"
    ],
    "difficulty": "Medium",
    "question_count": 13,
    "raw_questions": [
      "What is an average?",
      "What is Cloud Computing?",
      "Why do we need cloud platforms?",
      "What is Artificial Intelligence?",
      "What is Machine Learning?",
      "Why is your CGPA low?",
      "How do you stay self-motivated despite setbacks?",
      "What’s the difference between TCS Ninja, Digital, and Prime?",
      "If selected for TCS Ninja, would you still join?"
    ]
  },
  {
    "title": "Hyland Software Interview Experience: Developer 2  (2025)",
    "url": "https://www.geeksforgeeks.org/interview-experiences/hyland-software-interview-experience-developer-2-2025/",
    "content": "I recently interviewed for the Developer 2 role at Hyland Software. The process involved three rounds of evaluation, primarily focused on \nAngular, TypeScript, Data Structures, and Software Design principles\n. Although I was selected, the position was eventually closed as the project for which hiring was initiated did not kick off as planned.\nRecruitment Overview Process\nTechnical Screening\nTechnical Round\nManagerial Round\nRound 1: Technical Screening (DSA + JavaScript)\nThis round was conducted virtually and involved data structures and algorithms, along with JavaScript-based problem solving .I was asked to implement logic for problems involving arrays, string manipulation, and time complexity optimization. He round also touched on JavaScript concepts such as closures, promises, and event loop.\nRound 2: Frontend Technical Round\nThis was a deep-dive into Angular and TypeScript.\nTopics included:\nComponent communication\nAngular lifecycle hooks\nReactive programming using RxJS\nWriting unit tests using Jest and Karma\nReal-world debugging scenarios\nI was also asked to walk through a mini system design of a front-end module using SOLID principles and best practices.\nRound 3: Managerial + System Design Round\nThis was a combination of managerial and high-level technical discussion.\nDiscussion around, Previous project architecture\nCollaboration within cross-functional teams\nDesigning a scalable component library\nUnderstanding of CI/CD, test automation, and code review processes\nBehavioral questions to assess cultural fit and problem-solving under constraints\nFinal Outcome\nI received positive feedback from all three rounds and was informed that I had been selected. However, the hiring process was eventually halted as the project the company had planned to onboard for was put on hold.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nIBM Interview Experience for Software Developer | On-Campus 2021\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nD\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\ndikshamishra4444\n \n\n\n\n\n\n\n\n\n\n\n\n\n \nFollow\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nExperiences-QnA",
    "source": "GeeksforGeeks",
    "company": "Hyland Software",
    "role": "",
    "rounds": [
      "Technical",
      "Managerial"
    ],
    "difficulty": "",
    "question_count": 1,
    "raw_questions": []
  },
  {
    "title": "Accenture Interview Experience For SASA Role- On Campus(2024)",
    "url": "https://www.geeksforgeeks.org/interview-experiences/accenture-interview-experience-for-sasa-role-on-campus-2024/",
    "content": "Hello Everyone! I received the interview opportunity during the 2024 on-campus placement drive for the System Administrator and Services Associate (SASA) role at Accenture. The entire process was well-structured and carried out in multiple stages, each designed to assess various technical and interpersonal capabilities.\nRecruitment Process Overview\nAptitude Round\nCoding Round\nCommunication Round (AI Mock)\nTechnical Interview\nHR Interview\nLetter of Intent (LOI 1 & 2)\nBackground Verification\nOffer Letter\nJoining Letter\nAptitude Round\nDuration:\n 1.5 hours\nMethod\n: Online Assessment at JECRC Foundation\nFocus Areas\n: Reasoning, Verbal Ability, MS Word, Excel, PowerPoint, Numerical Aptitude, and Core Subjects (Computer Networking, DBMS, OS)\nThe test covered a wide variety of questions evaluating logical thinking, language skills, and fundamental technical knowledge. The results were declared within 10 minutes, and I was selected for the next round.\nCoding Round\nDuration: \n1 hour\nMethod\n: Online Coding Platform\nNumber of Questions\n: 2\nQ1. Sliding Window Maximum – Array based problem (Hard Category)\n\n\nC++\n\n\n\n\n#include\n \n<iostream>\n\n\nusing\n \nnamespace\n \nstd\n;\n\n\n\nclass\n \nGFG\n \n{\n\n\npublic\n:\n\n\n    \nvector\n<\nint\n>\n \nmaxSlidingWindow\n(\nvector\n<\nint\n>&\n \nnums\n,\n \nint\n \nk\n)\n \n{\n\n\n        \nint\n \nn\n \n=\n \nnums\n.\nsize\n();\n\n\n        \ndeque\n<\nint\n>\ndq\n;\n\n\n        \nvector\n<\nint\n>\nans\n;\n \n\n\n\n        \nfor\n(\nint\n \ni\n \n=\n \n0\n \n;\n \ni\n \n<\n \nn\n \n;\n \ni\n++\n)\n \n{\n\n\n            \n// remove if it goes out of the window \n\n\n            \nwhile\n(\n!\ndq\n.\nempty\n()\n \n&&\n \ndq\n.\nfront\n()\n \n<=\n \ni\n \n-\n \nk\n){\n\n\n                \ndq\n.\npop_front\n();\n\n\n            \n}\n\n\n            \nwhile\n(\n!\ndq\n.\nempty\n()\n \n&&\n \nnums\n[\ndq\n.\nback\n()]\n \n<=\n \nnums\n[\ni\n]){\n\n\n                \ndq\n.\npop_back\n();\n\n\n            \n}\n\n\n            \ndq\n.\npush_back\n(\ni\n);\n\n\n\n            \nif\n(\ni\n \n>=\n \nk\n \n-\n \n1\n)\n \nans\n.\npush_back\n(\nnums\n[\ndq\n.\nfront\n()]);\n\n\n\n        \n}\n\n\n\n        \nreturn\n \nans\n;\n\n\n    \n}\n\n\n};\n\n\n\n\n \n#include <iostream>\nusing\n \nnamespace\n \nstd\n;\n​\nclass\n \nGFG\n {\npublic\n:\n    \nvector\n<\nint\n>\n \nmaxSlidingWindow\n(\nvector\n<\nint\n>&\n \nnums\n, \nint\n \nk\n) {\n        \nint\n \nn\n \n=\n \nnums\n.\nsize\n();\n        \ndeque\n<\nint\n>\ndq\n;\n        \nvector\n<\nint\n>\nans\n; \n​\n        \nfor\n(\nint\n \ni\n \n=\n \n0\n ; \ni\n \n<\n \nn\n ; \ni\n++\n) {\n            \n// remove if it goes out of the window \n            \nwhile\n(\n!\ndq\n.\nempty\n() \n&&\n \ndq\n.\nfront\n() \n<=\n \ni\n \n-\n \nk\n){\n                \ndq\n.\npop_front\n();\n            }\n            \nwhile\n(\n!\ndq\n.\nempty\n() \n&&\n \nnums\n[\ndq\n.\nback\n()] \n<=\n \nnums\n[\ni\n]){\n                \ndq\n.\npop_back\n();\n            }\n            \ndq\n.\npush_back\n(\ni\n);\n​\n            \nif\n(\ni\n \n>=\n \nk\n \n-\n \n1\n) \nans\n.\npush_back\n(\nnums\n[\ndq\n.\nfront\n()]);\n​\n        }\n​\n        \nreturn\n \nans\n;\n    }\n};\nQ2. Valid Parenthesis – Stack & String based (Easy and frequently asked problem)\n\n\nC++\n\n\n\n\n#include\n \n<iostream>\n\n\nusing\n \nnamespace\n \nstd\n;\n\n\n\nclass\n \nGFG\n \n{\n\n\npublic\n:\n\n\n    \nbool\n \nisValid\n(\nstring\n \ns\n)\n \n{\n\n\n        \n\n\n        \n//TC = O(N) SC = O(N) cz uaing stack\n\n\n       \n\n\n        \nstack\n<\nchar\n>\n \ns1\n;\n\n\n\n        \nfor\n(\nint\n \ni\n \n=\n \n0\n;\n \ni\n \n<\n \ns\n.\nsize\n();\n \ni\n++\n){\n\n\n\n            \nif\n(\ns\n[\ni\n]\n \n==\n \n'['\n \n||\n \ns\n[\ni\n]\n \n==\n \n'('\n \n||\n \ns\n[\ni\n]\n \n==\n \n'{'\n){\n\n\n                \n\n\n                \ns1\n.\npush\n(\ns\n[\ni\n]);\n\n\n            \n}\n\n\n            \nelse\n{\n\n\n                \nif\n(\ns1\n.\nempty\n()){\n \n//edge case\n\n\n                    \nreturn\n \nfalse\n;\n\n\n                \n}\n\n\n                \nelse\n \nif\n(\ns1\n.\ntop\n()\n \n==\n \n'['\n \n&&\n \ns\n[\ni\n]\n \n==\n \n']'\n){\n\n\n                    \ns1\n.\npop\n();\n\n\n                \n}\n\n\n                \nelse\n \nif\n(\ns1\n.\ntop\n()\n \n==\n \n'('\n \n&&\n \ns\n[\ni\n]\n \n==\n \n')'\n){\n\n\n                    \ns1\n.\npop\n();\n\n\n                \n}\n\n\n                \nelse\n \nif\n(\ns1\n.\ntop\n()\n \n==\n \n'{'\n \n&&\n \ns\n[\ni\n]\n \n==\n \n'}'\n){\n\n\n                    \ns1\n.\npop\n();\n\n\n                \n}\n\n\n                \nelse\n{\n\n\n                    \nreturn\n \nfalse\n;\n\n\n                \n}\n\n\n            \n}\n\n\n        \n}\n\n\n        \n\n\n        \nif\n(\ns1\n.\nempty\n()\n \n==\n \n1\n){\n\n\n\n            \nreturn\n \ntrue\n;\n\n\n        \n}\n\n\n        \nreturn\n \nfalse\n;\n\n\n    \n}\n\n\n};\n\n\n\n\n \n#include <iostream>\nusing\n \nnamespace\n \nstd\n;\n​\nclass\n \nGFG\n {\npublic\n:\n    \nbool\n \nisValid\n(\nstring\n \ns\n) {\n        \n        \n//TC = O(N) SC = O(N) cz uaing stack\n       \n        \nstack\n<\nchar\n>\n \ns1\n;\n​\n        \nfor\n(\nint\n \ni\n \n=\n \n0\n; \ni\n \n<\n \ns\n.\nsize\n(); \ni\n++\n){\n​\n            \nif\n(\ns\n[\ni\n] \n==\n \n'['\n \n||\n \ns\n[\ni\n] \n==\n \n'('\n \n||\n \ns\n[\ni\n] \n==\n \n'{'\n){\n                \n                \ns1\n.\npush\n(\ns\n[\ni\n]);\n            }\n            \nelse\n{\n                \nif\n(\ns1\n.\nempty\n()){ \n//edge case\n                    \nreturn\n \nfalse\n;\n                }\n                \nelse\n \nif\n(\ns1\n.\ntop\n() \n==\n \n'['\n \n&&\n \ns\n[\ni\n] \n==\n \n']'\n){\n                    \ns1\n.\npop\n();\n                }\n                \nelse\n \nif\n(\ns1\n.\ntop\n() \n==\n \n'('\n \n&&\n \ns\n[\ni\n] \n==\n \n')'\n){\n                    \ns1\n.\npop\n();\n                }\n                \nelse\n \nif\n(\ns1\n.\ntop\n() \n==\n \n'{'\n \n&&\n \ns\n[\ni\n] \n==\n \n'}'\n){\n                    \ns1\n.\npop\n();\n                }\n                \nelse\n{\n                    \nreturn\n \nfalse\n;\n                }\n            }\n        }\n        \n        \nif\n(\ns1\n.\nempty\n() \n==\n \n1\n){\n​\n            \nreturn\n \ntrue\n;\n        }\n        \nreturn\n \nfalse\n;\n    }\n};\nBoth problems tested algorithmic thinking and problem-solving ability. I managed to solve both and moved to the next stage.\nCommunication Round (AI Mock)\nMode\n: Online(You can give this round at anywhere according to your availability) \nType\n: Non-Elimination (But preparation recommended)\nThis round tested spoken English using AI-based evaluation, broken into the following sections:\nReading\n – Read 8 sentences aloud\nRepeating Sentences\n – Repeat 16 audio sentences\nJumbled Sentences\n – Reconstruct and read 10 jumbled sentences\nQ&A\n – Answer 24 simple questions (one/two-word answers)\nStory Telling\n – Listen to a story twice and retell it in 30 seconds\nOpen Questions \n– Answer HR-style questions in 60 seconds\nThe round tested pronunciation, fluency, vocabulary, and overall communication clarity. Cleared this round as well.\nTechnical Interview\nDuration\n: 30–40 minutes\nPanel\n: Senior Software Developer at Accenture\nMode\n: In-Person/Online\nThe interview started with a brief introduction followed by questions from:\nLanguages\n: C++, Core Java\nConcepts\n: OOPs, DBMS, OS, System Design\nCoding\n: Reverse an array, Find second-largest element\nProjects\n: Deep dive into technical projects\nBehavioral\n: Strengths and weaknesses\nOverall, a balanced mix of technical and behavioral assessment. I cleared this round as well.\nHR Interview\nTiming\n: 2–3 days after technical round\nMode\n: Virtual\nFocus\n: General HR Questions\nSimple and direct questions regarding expectations, goals, and behavioral aspects. Cleared this round too.\nLetter of Intent (LOI) and Background Verification\nLOI 1 received 1.5 months after interview\nLO2 received 25 days after LO1\nBackground verification and validations followed afterward\nOffer & Joining Letter\nAfter clearing all rounds and successful verification, I received the Offer Letter for the SASA Role at Accenture, followed by the Joining Letter and onboarding details.\nFinal Thoughts\nIt was an insightful experience that tested both technical and soft skills across various dimensions. The structured process, quick feedback, and clarity made this journey with Accenture highly professional and rewarding.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nAccenture Interview Experience| on Campus  2024\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nM\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\nmohitkumawat04\n \n\n\n\n\n\n\n\n\n\n\n\n\n \nFollow\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nAccenture\n\n\n\n\n\n\nExperiences-QnA\n\n\n \n\n\n\n\n\n\nPractice Tags : \n\n\n\n\nAccenture",
    "source": "GeeksforGeeks",
    "company": "Accenture",
    "role": "SASA Role- On Campus(2024)",
    "rounds": [
      "Online Assessment",
      "Technical",
      "HR",
      "Coding",
      "Aptitude"
    ],
    "difficulty": "Hard",
    "question_count": 3,
    "raw_questions": [
      "Q1. Sliding Window Maximum – Array based problem (Hard Category)",
      "Q2. Valid Parenthesis – Stack & String based (Easy and frequently asked problem)",
      "Q&A"
    ]
  },
  {
    "title": "TCS Interview Experience | TCS NQT 2025 | Prime Category | Off-campus",
    "url": "https://www.geeksforgeeks.org/interview-experiences/tcs-interview-experience-tcs-nqt-2025-prime-category-off-campus/",
    "content": "I applied for the \nTCS NQT\n through the NextStep portal, which my college guided me through in February 2025. I received the admit card 15 days before the exam, which had all the necessary details about the exam centre, instructions, and schedule. The exam was conducted in March 2025 at a designated centre for the role of TCS Prime Category.\nTCS NQT Pattern and Experience\nThe test was divided into sections:\nNumerical Ability\nVerbal Ability\nReasoning Ability\nAdvanced Quantitative Ability\nAdvanced Reasoning Ability\nHands-on Coding (2 problems)\nEach section had its own timer, and once the time ended, it automatically moved to the next, so \ntime management is very important.\nI found the overall test manageable, but I spent too much time on Numerical Ability, so I couldn't complete it entirely. The coding section was quite easy, but the trick was in understanding the question requirements clearly.\nThe coding problems were:\nFind the LCM \nof two numbers\nFind the Frequency of elements \nin an array (moderate level, involved an election-type logic)\nThe questions were lengthy in wording, so I had to carefully read the sample test cases to figure out the exact requirement. Each problem had \n7 test cases - \n2 public and 5 hidden. I was able to pass 7/7 in the first and 5/7 in the second\nI used \nPython, \nand thankfully, everything worked well - but be cautious about indentation issues, as some of my peers faced errors due to that. \nInterview Call (Prime Category)\nI received my interview call for the Prime category in May 2025, around 1.5 months after the NQT exam. The mail asked me to fill a form to choose my preferred interview location. After that, I received another mail with the final interview date and venue. The interview was conducted in person at TCS Chennai, starting with document verification, followed by panel allotment.\nEach panel had three interviewers:\nTechnical Interview\nManagerial Interview\nHR/Personal Interview\n1. Technical Round:\nThis was a one-on-one session where the interviewer focused mainly on my resume, internship and practical experience.\nQuestions Asked:\nTell me about your internship experience.\nWhat was your role and contribution in the internship?\nWhich tech stack did you use during your internship?\nHow did your internship experience help you improve as a developer?\nWhat is GitHub? What are Git commits, and how do you manage version control?\nWhat is JavaScript Destructuring, and where have you used it?\nGiven a pattern, explain how you'll print it and write the code.\nCoding task: Find frequency of elements in an array.\nWhich project from your resume has the most real-world impact? Why?\nJustify the problem it solves and how it helps.\n2. Managerial Round:\nThis round assessed my \nleadership, decision-making, and technical awareness.\nQuestions Asked:\nIf your entire team is more experienced than you, how would you manage?\nHow would you deal with team members who don't support you\nAre you comfortable working with unknown or diverse teams? (with follow-up questions)\nHave you taken the lead in any project or team activity before?\nDo you know about cloud computing?\nWhat are its types?\nWhat is PAAS? \nWhat kind of service is Google Drive?\nGive example for PaaS and SaaS.\nWhat is Private Cloud and Hybrid Cloud?\n3. HR/Personal Round:\nThis was a casual and reflective round.\nQuestions Asked:\nHave you attended any interviews before this one?\nHave you received offers from any companies?\nAre you still working with the same company or has it concluded?\nWhat challenges did you face during your internship?\nAre you open to relocation and flexible with work timings?\nClosing Thoughts & Tips\nMy overall TCS interview experience was smooth, professional, and highly structured. The panelists were friendly, but focused on evaluating practical knowledge, adaptability, and clear communication.\nHere are a few key takeaways and tips from my journey:\n Be confident when explaining your projects and internship—know your contribution, tech stack, and learning outcomes.\n Keep your resume simple and honest. Questions will be based directly on it.\n Be ready for questions on current technologies like cloud computing, blockchain, 5G, or even AI/ML—even basic awareness can help.\n If you’ve worked on a final year project or research paper, prepare to discuss it in depth.\n Practice coding basics, pattern printing, and logical questions—they care more about your thought process than just correct syntax.\nCommunication is key. Think aloud and explain your approach clearly, even if you’re unsure of the exact answer.\nAs of now (June 2025), I am still awaiting the final result. Hoping for a positive outcome!  All the best to anyone preparing for TCS NQT or interviews! You've got this.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nTCS Prime Interview Experience (On-Campus)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nAnonymous\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n2\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nTCS NQT\n\n\n\n\n\n\nExperiences-QnA",
    "source": "GeeksforGeeks",
    "company": "TCS",
    "role": "",
    "rounds": [
      "Technical",
      "HR",
      "Managerial",
      "Coding"
    ],
    "difficulty": "Easy",
    "question_count": 22,
    "raw_questions": [
      "Questions Asked:",
      "What was your role and contribution in the internship?",
      "Which tech stack did you use during your internship?",
      "How did your internship experience help you improve as a developer?",
      "What is GitHub? What are Git commits, and how do you manage version control?",
      "What is JavaScript Destructuring, and where have you used it?",
      "Which project from your resume has the most real-world impact? Why?",
      "Questions Asked:",
      "If your entire team is more experienced than you, how would you manage?",
      "Are you comfortable working with unknown or diverse teams? (with follow-up questions)",
      "Have you taken the lead in any project or team activity before?",
      "Do you know about cloud computing?",
      "What are its types?",
      "What is PAAS?",
      "What kind of service is Google Drive?",
      "What is Private Cloud and Hybrid Cloud?",
      "Questions Asked:",
      "Have you attended any interviews before this one?",
      "Have you received offers from any companies?",
      "Are you still working with the same company or has it concluded?",
      "What challenges did you face during your internship?",
      "Are you open to relocation and flexible with work timings?"
    ]
  },
  {
    "title": "SHELL Interview Experience for Associate Software Engineer",
    "url": "https://www.geeksforgeeks.org/interview-experiences/shell-interview-experience-for-associate-software-engineer/",
    "content": "I recently appeared for an on-campus interview conducted by Shell for the role of Associate Software Engineer. Shell is a global group of energy and petrochemical companies, known for its expertise in petroleum, natural gas, and lubricants. The company offers dynamic career opportunities and values innovation and sustainability in its operations.\nCandidate Information\nStatus\n: Placed\nExperience\n: 1+ years of relevant experience (including internship/project work)\nTarget Position\n: Associate Software Engineer\nLocation\n: Delhi\nInterview Date\n: 4th Oct, 2024\nRecruitment  Process Overview\nResume Shortlisting\nOnline Test\nTechnical + HR Interview\nRound 1: Resume Shortlisting\nResume Shortlisting\nFocus: Initial evaluation based on qualifications, projects, and relevant experience\nOutcome: Selected for further rounds\nRound 2: Online Test\nDuration\n: 2 hours\nMethod\n: Online\nFocus\n: Data Structures & Algorithms, SQL, Aptitude\nStructure\n: 4 Sections, 48 Questions in total\n Question on DSA Section\n:\nProblem 1\n: A combinatorics problem involving counting how many different paint combinations can be created using at most Y paints from X options, including original paints.\nProblem 2\n: A graph theory problem requiring the shortest path between two nodes (John and Dave) in an undirected graph, representing the fewest number of relatives in a gift transfer chain.\n Question on  SQL Section\n: \nBasic to intermediate-level query problems involving table operations and data filtering.\n Question on Aptitude Section\n:\nGeneral logical reasoning and mathematical aptitude questions.\nObstacles\n: Not any.\nRound 3: Technical + HR Interview\nI received the interview call through an official email from Shell and was also informed about the opportunity by my college faculty. Here is a detailed breakdown of my interview process:\nDuration\n: 1 hour\nMethod\n: Video Call\nFocus\n: Resume-based HR questions and conceptual technical understanding\nHR Questions\n:\nPersonal introduction\nDetails about past projects and internships\nTeamwork and collaboration experiences\nTechnical Questions\n:\nExplanation of Tortoise and Hare Algorithm for detecting cycles in a linked list\nMultiple follow-up questions on Linked Lists and how to solve common problems\nConceptual discussion on Exception Handling in Java, specifically the roles of try, catch, and finally blocks\nObstacles\n: No major obstacles, but the mixed format required switching between HR and technical topics quickly.\nNote\n: No live coding was required; the interviewer focused on understanding and explanation of concepts and algorithms.\nPost-Interview Reflections\nCompany Culture Insights\n: The interviewer was friendly and attentive, which reflected a collaborative and learning-focused culture.\nWork Environment\n: As the interview was virtual, there was limited exposure to the workplace environment, but communication was clear and professional.\nBenefits Highlight\n: Benefits were not discussed during the interview.\nEvaluator Feedback\n: While direct feedback was not provided, the interviewer seemed satisfied with the clarity and depth of answers during the technical discussion.\nSuggestions for Improvement\n: A clearer separation between HR and technical sections during the interview could help candidates prepare and perform more confidently.\nAdditional Information\nSelected candidates were informed within two days of the online test. The interview was scheduled three days after the result announcement.\nClosing Note\nOverall, the interview experience was smooth and well-organized. The questions tested both conceptual understanding and the ability to explain technical logic clearly. I appreciated the opportunity to share my experience and learnings and am looking forward to the next steps.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nAccenture Interview Experience For Associate Software Engineer\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nL\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\nlaibaahjcia\n \n\n\n\n\n\n\n\n\n\n\n\n\n \nFollow\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nRoyal Dutch Shell",
    "source": "GeeksforGeeks",
    "company": "SHELL",
    "role": "Associate Software Engineer",
    "rounds": [
      "Technical",
      "HR",
      "Coding",
      "Aptitude"
    ],
    "difficulty": "",
    "question_count": 1,
    "raw_questions": [
      "Question on DSA Section",
      "Question on  SQL Section",
      "Question on Aptitude Section",
      "HR Questions"
    ]
  },
  {
    "title": "My Interview Experience at A.P. Moller - Maersk",
    "url": "https://www.geeksforgeeks.org/interview-experiences/my-interview-experience-at-a-p-moller-maersk/",
    "content": "The interview process at A.P. Moller - Maersk was structured, professional and campus-driven with a strong focus on both technical depth and cultural alignment. Maersk visited our campus -The National Institute of Engineering, Mysore in June 2025 as part of their campus hiring initiative. The company was hiring for the Software Development Engineer (SDE) role. They were specifically looking for candidates with strong proficiency in C# and the .NET framework, as these technologies are central to their development stack.\nApplication Status:\nTotal Applicants:\n Around 250 students\nEligible Branches\n: Computer Science (CS), Information Science (IS)\nShortlisted for Online Assessment\n: Approximately 200 students\nCleared Online Assessment (Moved to Technical Round)\n: 82 students\nCleared Technical Round (Moved to Managerial Round)\n: 35 students\nShortlisted for Final HR Discussion\n: 20 students\nFinal Offers Made\n: 13 students\nRound 1: Online Assessment\nThe first round was an Online Assessment conducted on the CoCubes platform by AON. It served as an elimination round and was designed to test candidates across multiple skill areas relevant to the role. The assessment consisted of the following sections:\nC# and .NET Fundamentals:\n This section included multiple choice questions focused on core concepts of the C# programming language, the .NET framework and LINQ queries. A strong understanding of object-oriented principles and common .NET components was essential.\nSQL Queries:\n Questions in this section tested the candidate’s ability to write and interpret SQL queries, including basic joins, aggregations and filtering operations.\nData Structures and Algorithms (DSA):\n This section included one coding question. The problem I encountered was: \"Flip bits at even positions\" The task was to manipulate a given binary number such that bits at even positions were flipped, requiring knowledge of bitwise operations and indexing logic.\nEnglish Language Assessment:\n In this section, candidates were given a topic and asked to write a short passage of approximately 150–180 words. This tests communication skills, grammar and the ability to express thoughts coherently.\nRound 2: Technical Interview\nThe Technical Round was conducted virtually and lasted about 30–45 minutes. It began with the interviewer asking me to introduce myself and briefly talk about my technical background including the programming languages and frameworks I’m most proficient in. The discussion then moved on to the projects listed on my resume with a strong focus on my architectural decisions and implementation choices. The interviewer asked a mix of project specific, conceptual and practical SQL/database questions along with a few behavioral queries toward the end. \nFew Questions from My Interview :\n1. Why have you used GraphQL as the API Gateway ?\nAnswer:\n GraphQL provides flexible querying, avoids overfetching and under fetching and serves multiple frontend needs efficiently through a single endpoint.\n2. Why microservices and not monolith?\nAnswer:\n Microservices offer better scalability, modular development  and fault isolation compared to monoliths.\n3. What are the advantages of RabbitMQ over Kafka?\nAnswer:\n RabbitMQ is easier to set up , better for low-latency message delivery and has strong support for message acknowledgements and retries.\n4. What if the size of RabbitMQ grows very big? How do you manage it?\nAnswer:\n Use TTL (Time-To-Live) policies, dead-letter queues and periodic cleanup strategies to manage message size and queues.\n5. Difference between Access Token and Refresh Token?\nAnswer:\n Access Token is short lived and used to access resources. Refresh Token is long lived and used to get new access tokens.\n6. Why do we need two tokens? Can’t we just extend the access token’s life?\nAnswer:\n Two tokens improve security. Short lived access tokens reduce risk if compromised and refresh tokens allow secure re-authentication.\n7. What is normalization?\nAnswer:\n Normalization is the process of organizing data to reduce redundancy and improve data integrity.\n8. Why is normalization important?\nAnswer:\n It ensures data consistency, eliminates duplicate data and maintains database efficiency.\n9. Which relational and non-relational databases have you worked with and why?\nAnswer: \nRelational: MySQL, PostgreSQL  for structured and relational data.Non-relational: MongoDB  for flexible schema and better scalability.\n10. What is the basic difference between relational and non-relational databases?\nAnswer:\n Relational uses structured tables with schemas. Non-relational stores data as documents or key value pairs offering schema flexibility.\n11. Write SQL queries on JOINs, GROUP BY, HAVING clause, and aggregate functions.\nAnswer (Example):\n SELECT d.name, COUNT(e.id) FROM employee e JOIN department d ON e.dept_id = d.id GROUP BY d.name HAVING COUNT(e.id) > 5;\n12. What are the types of JOINs?\nAnswer:\n INNER JOIN, LEFT JOIN, RIGHT JOIN, FULL OUTER JOIN.\n13. Is LEFT JOIN and LEFT OUTER JOIN the same?\nAnswer:\n Yes they are the same. LEFT JOIN is a shorthand for LEFT OUTER JOIN.\n14. What is the advantage of using Kafka in your chat app project?\nAnswer\n: Kafka supports high throughput, horizontal scalability and ensures reliable real-time message streaming across services.\n15. How do you ensure scalability in your system?\nAnswer\n: Use stateless services, load balancers, database sharding, horizontal scaling and caching mechanisms.\n16. Which database do you prefer to ensure scalability – relational or non-relational?\nAnswer:\n Non-relational databases like MongoDB for dynamic and scalable use cases especially with large or unstructured data.\n17. What is gRPC? How does it work and how is it better than REST (HTTP)?\nAnswer: \ngRPC is a high performance RPC framework using HTTP/2 and Protocol Buffers it's faster and supports bi-directional streaming compared to REST. \n18. Two DSA questions on linked lists \n1. \nReverse a linked list\n2. \nClone linked list with random pointer\nAnd a few more technical questions related to my projects and course.\nRound 3:\n Behavioral + HR Interview Round \n1. Introduce Yourself\nI provided a brief overview of my academic background, technical skills, project experiences and areas of interest  mainly backend development and microservices architecture. I also highlighted my enthusiasm for solving real world problems using scalable solutions.\n2. Why Choose Maersk?\nI expressed my interest in Maersk due to its global impact in logistics and supply chain innovation strong focus on digital transformation and sustainability leadership. The company’s commitment to employee growth and inclusivity also resonated with me.\n3. What Are Your Views on Global Sustainability?\nI talked about how sustainability in technology and business is essential for the future. I mentioned Maersk’s efforts in achieving net zero emissions and how I’d love to be part of a company that values environmental responsibility.\n4. Are You Inspired by Any Project Done by Maersk?\nI referred to Maersk's TradeLens blockchain project which aims to bring transparency and efficiency to global trade.\n5. Do You Like Reading Books? What Have You Read Recently?\nI shared that I enjoy reading non-fiction and recently read \"Rich Dad and Poor Dad\" and \"The Talkative Man by R.K.Narayan\" which emphasizes the importance of focused productivity  something I try to practice during development and learning.\n6. Was There a Situation of Conflict in Any Project with Your Teammate? How Did You Resolve It?\nYes. I mentioned a minor disagreement over the choice of tech stack in a team project. We resolved it by discussing pros and cons calmly and agreeing on a balanced solution that suited our timeline and learning goals.\n7. Where Do You See Yourself in the Next 5 Years?\nI said I see myself growing as a strong backend engineer gaining exposure to scalable distributed systems and ideally leading a team or contributing to key projects at Maersk that drive global impact.\n8. How Do You Handle Pressure?\nI shared that I break down problems into smaller tasks prioritize them and stay calm under deadlines. I also mentioned how proper planning and communication help reduce stress and ensure clarity.\n9. What Keeps You Motivated?\nContinuous learning, building meaningful software and solving problems that make a real world impact keep me motivated. I enjoy the sense of achievement when a solution works and adds value.\nAdditional Information\nPractice for DSA fundamentals.\nStudy core CS subjects like Operating Systems, Computer Networks and DBMS.\nPractice SQL queries regularly.\nUnderstand your projects deeply you should be able to justify your choices clearly.\nMost importantly build strong fundamentals in both programming and systems design.\nClosing Note\nThe overall interview experience with A.P. Moller Maersk was extremely positive. The process was structured  and the questions were aligned with my skill set. I was able to answer almost all the questions effortlessly thanks to my preparation and project experience. I also secured an offer from A.P. Moller - Maersk and I look forward to the exciting journey ahead with a company that values both technical depth and cultural fit.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nMaersk Interview Expereience For Data Scientist\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nAnonymous\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nExperiences-QnA",
    "source": "GeeksforGeeks",
    "company": "My",
    "role": "",
    "rounds": [
      "Online Assessment",
      "Technical",
      "HR",
      "Managerial",
      "Coding"
    ],
    "difficulty": "Hard",
    "question_count": 32,
    "raw_questions": [
      "SQL Queries:",
      "Questions in this section tested the candidate’s ability to write and interpret SQL queries, including basic joins, aggregations and filtering operations.",
      "Few Questions from My Interview :",
      "1. Why have you used GraphQL as the API Gateway ?",
      "2. Why microservices and not monolith?",
      "3. What are the advantages of RabbitMQ over Kafka?",
      "4. What if the size of RabbitMQ grows very big? How do you manage it?",
      "5. Difference between Access Token and Refresh Token?",
      "6. Why do we need two tokens? Can’t we just extend the access token’s life?",
      "7. What is normalization?",
      "8. Why is normalization important?",
      "9. Which relational and non-relational databases have you worked with and why?",
      "10. What is the basic difference between relational and non-relational databases?",
      "12. What are the types of JOINs?",
      "13. Is LEFT JOIN and LEFT OUTER JOIN the same?",
      "14. What is the advantage of using Kafka in your chat app project?",
      "15. How do you ensure scalability in your system?",
      "16. Which database do you prefer to ensure scalability – relational or non-relational?",
      "17. What is gRPC? How does it work and how is it better than REST (HTTP)?",
      "2. Why Choose Maersk?",
      "3. What Are Your Views on Global Sustainability?",
      "4. Are You Inspired by Any Project Done by Maersk?",
      "5. Do You Like Reading Books? What Have You Read Recently?",
      "6. Was There a Situation of Conflict in Any Project with Your Teammate? How Did You Resolve It?",
      "7. Where Do You See Yourself in the Next 5 Years?",
      "8. How Do You Handle Pressure?",
      "9. What Keeps You Motivated?"
    ]
  },
  {
    "title": "Cognizant Interview Experience for GenC Pro Cybersecurity",
    "url": "https://www.geeksforgeeks.org/interview-experiences/cognizant-interview-experience-for-gen-c-pro-cybersecurity-1/",
    "content": "Hello Everyone!  Cognizant is a global IT services and consulting company that provides digital, technology, consulting, and operations services. With a strong presence in over 40 countries, Cognizant is known for hiring engineering graduates through its GenC, GenC Pro, and GenC Next programs, catering to both freshers and domain-specialised roles such as Cybersecurity, Full Stack, and Digital Engineering.\nHow I Got the Interview Call?\nI applied for Cognizant through the on-campus placement process. We didn’t register separately for GenC, GenC Pro, or GenC Next. Instead, based on the certificates we uploaded during registration and our performance in the assessments, candidates were shortlisted for specific roles.\nAfter completing the Communication, Aptitude and Gamified, and Technical Assessment rounds, some students were selected for the GenC Pro role, and I was one among them. The entire application and selection process was conducted through Superset.\nRecruitment Process Overview\nInitial Screening:\nCommunication Assessment\nAptitude and Gamified Assessment\nTechnical Assessmen\nt\nTechnical + HR Interview\nRound 1: Initial Screening\nOnce the application was submitted, eligible candidates were automatically shortlisted and received invites for the assessments.\nRound 2: Communication Assessment\nDate:\n March 13, 2025  \nDuration\n: 30 minutes  \nMode:\n Online (via Superset)  \nFocus Areas:\nCommunication and listening skills  \nGrammar correction  \nSentence formation  \nFluency and pronunciation  \nObstacles\n: The audio was fast-paced and required full concentration to answer the comprehension tasks correctly.\nRound 3. Aptitude and Gamified Assessment\nDate\n: March 19, 2025  \nDuration\n: 90 minutes  \nMode\n: Online  \nFocus Areas\n:\n Quantitative aptitude  \n Logical reasoning  \n Puzzle-solving through gamified scenarios  \nKey Tasks\n: Pattern recognition, mathematical reasoning, and decision-making in real-time game environments.  \nObstacles\n: Adaptive difficulty and tight timing made the puzzles tricky to solve under pressure.\nRound 4: Technical Assessment\nDate\n: March 27, 2025  \nDuration\n: 60 minutes  \nMode\n: Online  \nFocus Areas:\n Programming logic  \n Code debugging  \n Output prediction  \nNote\n: Question difficulty varied based on the student’s assigned technology cluster (mine was Java + SQL).\nRound 5:  Technical + HR Interview\nDate:\n May 16, 2025  \nDuration\n: 40–45 minutes  \nMode\n: Online Video Interview\nOnce shortlisted, I received an email from Cognizant/Superset with the interview schedule. The interview platform was a customized virtual meeting room that included integrated code editors and an interview panel. I was notified via both email and SMS when it was my turn to join.\nInterview Questions: \nTechnical (Cybersecurity, Web, Programming):\nIntroduce yourself  \nWhat is cryptography and why is it used?  \nWhat are the different types of cryptographic algorithms?  \nWhat is phishing? Types of phishing?  \nHow do you identify a phishing email?  \nExplain penetration testing  \nWrite a program to print duplicate characters in a string  \nHow would you improve this program further?  \nDifference between Java and JavaScript  \n How to link a CSS file to HTML?  \nHow to navigate between tabs using HTML?  \nPurpose of <canvas> tag  \nWhat validation methods did you use in your projects?  \nUse of SQL for data storage and insertion  \nSQL query to add a new column  \nExplain Joins and Union in SQL  \nDifference between DELETE and TRUNCATE  \nUsing dates/calendars in HTML  \nDifference between ordered and unordered lists\nHR Questions:\nWhy are you interested in cybersecurity?  \nRate yourself in Cybersecurity, Java, and SQL  \nWillingness to relocate?  \nOpen to working in shifts?  \nCan you join from May 25?  \n Are you comfortable taking up different roles if required?  \n Do you have any questions for us?\nChallenges Faced:\nMixture of technical depth and HR questions  \nHTML-related syntax of HTML 5 questions were a bit tricky  \nCoding questions tested implementation clarity and alternative logic\nPost-Interview Refelection\nSuperset status changed to: “Interim Offer” on May 28, 2025  \nGot Letter of Intent (LOI) on “JUNE 19 “ and waiting for further onboarding instructions.\nFinal Thoughts:\nIf you're preparing for Cognizant GenC Pro Cybersecurity, make sure your basics in Java, SQL, Cybersecurity, and HTML/CSS are strong. Be confident, speak clearly, and practice mock interviews with behavioral questions. Also, keep an eye on your Superset dashboard and emails for updates!\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nCognizant Interview Experience for GenC / GenC Elevate\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\nabdulmouk6lv\n \n\n\n\n\n\n\n\n\n\n\n\n\n \nFollow\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nExperiences-QnA",
    "source": "GeeksforGeeks",
    "company": "Cognizant",
    "role": "GenC Pro Cybersecurity",
    "rounds": [
      "Technical",
      "HR",
      "Coding",
      "Aptitude"
    ],
    "difficulty": "Hard",
    "question_count": 18,
    "raw_questions": [
      "How I Got the Interview Call?",
      "Quantitative aptitude",
      ": Question difficulty varied based on the student’s assigned technology cluster (mine was Java + SQL).",
      "What is cryptography and why is it used?",
      "What are the different types of cryptographic algorithms?",
      "What is phishing? Types of phishing?",
      "How do you identify a phishing email?",
      "How would you improve this program further?",
      "How to link a CSS file to HTML?",
      "How to navigate between tabs using HTML?",
      "What validation methods did you use in your projects?",
      "SQL query to add a new column",
      "HR Questions:",
      "Why are you interested in cybersecurity?",
      "Willingness to relocate?",
      "Open to working in shifts?",
      "Can you join from May 25?",
      "Are you comfortable taking up different roles if required?",
      "Do you have any questions for us?"
    ]
  },
  {
    "title": "Cognizant Interview Experience for GenC Pro Cybersecurity 2025 On-Campus",
    "url": "https://www.geeksforgeeks.org/interview-experiences/cognizant-interview-experience-for-genc-pro-cybersecurity-2025-on-campus/",
    "content": "Round 1:\nStatus: [2025 graduate fresher, applied via on-campus hiring].\nRole: GenC (4 LPA), GenC-Pro (5.4 LPA), GenC-Next (6.75 LPA).\nInterview Date: [May, 2025]\nOverview of Interview Process:\nInitial Screening\nResume screening.\nThe first round consists of 3 rounds\n1. Communication Round. 2. Aptitude Round. 3. Technical Round it consist of 5 question 2 sql, 2 coding problem based on cluster and 1 web development question.\nIf you score good marks combined in 3 rounds, you will get shortlisted to interview.\nTechnical Round\nDuration: 30 min.\nMethod: They have their own platform for virtual interviews.\nFocus: Interview based on the cluster you have choosed and CyberSecurity.\nId verification \nQuestion on Public static void main\nQuestions on Arraylist \nInterface vs Abstract class\nArraylist add element and remove duplicate \nAbout the resume questions \nOn AWS\nOn TCP/IP\nWilling to join within may 25\nRelocate \nAny hr questions\nPost-Interview Reflections:\nGood but did'nt get selected.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nCognizant Interview Experience for Gen-Pro (2025-graduate) On-Campus\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nAnonymous\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nCognizant GenC\n\n\n\n\n\n\nCognizant\n\n\n\n\n\n\nExperiences-QnA\n\n\n \n\n\n\n\n\n\nPractice Tags : \n\n\n\n\nCognizant",
    "source": "GeeksforGeeks",
    "company": "Cognizant",
    "role": "GenC Pro Cybersecurity 2025 On-Campus",
    "rounds": [
      "Technical",
      "HR",
      "Coding",
      "Aptitude"
    ],
    "difficulty": "",
    "question_count": 0,
    "raw_questions": [
      "Question on Public static void main",
      "Questions on Arraylist"
    ]
  },
  {
    "title": "Infosys -DSE| Interview Experience|hackwithinfy",
    "url": "https://www.geeksforgeeks.org/interview-experiences/infosys-dse-interview-experience-hackwithinfy/",
    "content": "Hello everyone! I am a 2025 graduate, and I applied for Hackwithinfy 2024. The interview process, which eventually led to my selection for the DSE role at Infosys, was an experience filled with anticipation, technical challenges, and learning opportunities.\nRecruitment Process Overview\nOnline Test\nShortlisting for DSE Round\nTechnical Interview \nRound 1: Online Test\nI applied for Hackwithinfy in August 2024. The online assessment consisted of three questions with a time duration of 3 hours. Out of the three, I managed to solve one difficult-level problem, which gave me the confidence to move forward. It was a challenging round, but I was glad to have completed it to the best of my ability.\nObstacles:\nOnly a select few candidates were able to make it through this round and move on to the next phase. It was a tough start, but I was fortunate enough to be one of them.\nRound 2: Shortlisting for DSE Role\nAfter a few months of waiting, I received an email in January 2025 informing me that I had been shortlisted for the DSE role. The email also asked me to select a location for my interview. I chose Bangalore, as it was the most convenient location for me.\nWaiting Period:\nAfter selecting the location, there was no communication from Infosys for a few months. This waiting period was long, but I stayed patient and prepared for the interview.\nRound 3: Technical Interview\nThe interviewer started by asking me for a self-introduction. Then, he asked for my opinion on Artificial Intelligence (AI), including its advantages and disadvantages. This was an interesting start, as it gave me a chance to express my thoughts on a current technological topic.\nTechnical Questions:\nAfter the initial discussion, the interviewer moved on to the technical section. The questions covered various topics, testing my knowledge and problem-solving abilities in different areas:\nObject-Oriented Programming (OOP)\n – I was asked questions to demonstrate my understanding of OOP principles.\nSQL and ER Diagrams\n – A few questions on SQL queries and Entity-Relationship diagrams were posed.\nCoding Challenges\n – I was given three coding problems to solve:\nFibonacci Series without Using a Temporary Variable\nArrayList-related Problem\nException Handling Problem\nThe interviewer also asked me to run the code and check its correctness.\nAdditional Questions:\nI was given some code snippets in C language and asked to determine the output.\nQuestions on HTML and CSS were also asked, focusing on basic concepts and their applications.\nThe interview was entirely technical, and there were no HR questions. The interviewer did not ask me to explain my projects, which was a bit unusual but didn’t make a significant impact on my performance. The interview lasted for about 45 minutes.\nFinal Outcome\nAfter the interview, I didn’t hear anything for about 10 days, which felt like an eternity. But then, on April 18th, 2025, I received an email from my TPO (Training and Placement Officer) that I had been selected for the DSE role at Infosys with a package of 6.25 LPA. I was overjoyed and relieved to know that my efforts had paid off.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nInfosys Hackwithinfy Interview Experience for DSE 2022\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nAnonymous\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n3\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nInfosys\n\n\n\n\n\n\nExperiences-QnA\n\n\n \n\n\n\n\n\n\nPractice Tags : \n\n\n\n\nInfosys",
    "source": "GeeksforGeeks",
    "company": "Infosys -DSE|",
    "role": "",
    "rounds": [
      "Online Assessment",
      "Technical",
      "HR",
      "Coding"
    ],
    "difficulty": "Hard",
    "question_count": 2,
    "raw_questions": [
      "SQL and ER Diagrams",
      "Questions on HTML and CSS were also asked, focusing on basic concepts and their applications."
    ]
  },
  {
    "title": "ZOHO Interview Experience for Fresher 2025 {Offcampus}",
    "url": "https://www.geeksforgeeks.org/interview-experiences/zoho-interview-experience-for-fresher-2025-offcampus/",
    "content": "Hey everyone! I recently appeared for the\n Zoho off-campus drive\n held on \nApril 4th,\n and I wanted to share my experience here. The drive saw a huge turnout of around 1500+ candidates, and by the end, only about\n 10–12 students\n were shortlisted. Though I couldn’t make it past the third round, I learned a lot and hope this post helps someone preparing for it in the future.\nRecruitment Process Overview:\nAptitude + Java Snippets\nCoding Round\nLow-Level Design (LLD)\nRound 1:  Aptitude + Java Snippets\nThis was the first and major filtration round.\n1. Total Questions: 20\n10 Aptitude Questions: \nMedium level (time, speed, probability, logical reasoning)\n10 Java Code Snippet Questions: \nTough and conceptually heavy\n2. Duration:\n 75 minutes\n3. Level: \nTough\n4. Shortlisted Candidates: \nOnly 90–100 from 1500+\nTip:\n Make sure you’re strong in both \nlogic-building and Java fundamentals. \nAnd yes, practice aptitude thoroughly — it was definitely the toughest round.\nRound 2: Coding Round\nThis was a\n coding round\n with 7 questions of medium level.\nTopics Included:\nTrees (e.g., Validate BST)\nHashMaps\nArrays & Strings\nSliding Window problems (both fixed and variable size)\nQuestions Asks:\nValidate BST\nlength of longest substring having distinct characters\nCheck palindrome\nFInd first missing Positive\nNumber of substring having exactly k characters\nFind the first non repeating character in a string in 1 pass\nObstacles:\n  Around 40–50 candidates cleared this round.\nTip:\n Focus on conceptual clarity and edge case handling. Practicing on platforms like GeeksForGeeks really helps here.\nRound 3: Low-Level Design (LLD)\nThis round was unexpectedly challenging.\nDesign a\n Task Manager application,\n and the interview was structured in  progressive steps:\nStarting from basic design\nAdding persistence using local file storage\nHandling multiple edge cases and improving functionality step by step\nObstacles\n: Only 10–15 students made it to the next technical face-to-face round mostly all of them got selected ig.\nAdditional Tips\nPrepare well for Aptitude: \nThis is the most difficult and most important round.\nLLD Practice is essential\n: Go beyond just DSA.\nGet Comfortable with\n \nonline IDEs: \nYou'll be expected to code in them during interviews.\nStay Consistent and Positive\n: Even if it doesn't work out, every experience counts.\nFinal Outcome\nUnfortunately, this is where my journey ended. Despite performing decently, I wasn’t shortlisted after LLD. I noticed that most of the candidates selected for the next round were from \nTamil Nadu\n, and while it may have been coincidence, I felt there may have been\n some bias \n— especially considering that a few others and I implemented almost the same solutions as some of the selected candidates.\nBut that’s life — sometimes it's about more than just the code.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nZoho Interview Experience (Off Campus) - Feb 2024\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nAnonymous\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n4\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nZoho\n\n\n\n\n\n\nExperiences-QnA\n\n\n \n\n\n\n\n\n\nPractice Tags : \n\n\n\n\nZoho",
    "source": "GeeksforGeeks",
    "company": "ZOHO",
    "role": "Fresher 2025",
    "rounds": [
      "Technical",
      "Coding",
      "Aptitude"
    ],
    "difficulty": "Medium",
    "question_count": 1,
    "raw_questions": [
      "Questions Asks:"
    ]
  },
  {
    "title": "TCS R&I - Intern | On Campus 2025 Interview Experience",
    "url": "https://www.geeksforgeeks.org/interview-experiences/tcs-r-i-intern-on-campus-2025-interview-experience/",
    "content": "Hello Everyone! I recently had the opportunity to interview for the position of Project Intern at TCS Research & Innovation (R&I) which took place through our campus placements in March 2025.\nRecruitment Process Overview\nInitial Screening\nTechnical Interview\nRound1: Initial Screening - CV Shortlisting \nDuration: \n2 weeks\nA total of 24 candidates were shortlisted based on their CVs. There was no preliminary written test or coding round in our case.\nRound 2: Technical Interview\nDuration:\n 40 minutes\nMethod:\n MS Teams\nKey Questions\n: Mostly related to the project, in my case ML and deep learning questions.\nDSA Questions: \nBST, Complete binary tree, Function pointer, Type casting, Sorting algorithms etc.\nOOPS Questions:\n 4 main concepts, Virtual function, Abstract base class, Real life application examples etc.\nNote: \nThis was one and only interview round.\nAdditional Tips\nPrepare a good CV (must).\nTry to keep a project related to the preference you choosed while applying for the role.\nFinal Outcome\nOut of 24 shortlisted students, 7 of us were selected, and I was one of them.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nPracto Internship Interview Experience | On-Campus 2021\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nS\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\nsankhadipbera21\n \n\n\n\n\n\n\n\n\n\n\n\n\n \nFollow\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n5\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nTCS\n\n\n\n\n\n\nExperiences-QnA\n\n\n \n\n\n\n\n\n\nPractice Tags : \n\n\n\n\nTCS",
    "source": "GeeksforGeeks",
    "company": "TCS R&I - Intern | On Campus 2025",
    "role": "",
    "rounds": [
      "Technical",
      "Coding"
    ],
    "difficulty": "",
    "question_count": 0,
    "raw_questions": [
      "Key Questions",
      "DSA Questions:"
    ]
  },
  {
    "title": "Nucleus Software Exports Interview Experience for SWE II Backend",
    "url": "https://www.geeksforgeeks.org/interview-experiences/nucleus-software-exports-interview-experience-for-swe-ii-backend/",
    "content": "I received the interview opportunity through Naukri.com, where I had applied for the Software Engineer 1 (SWE 1) role at \nNucleus Software Exports\n. The interview was organised in a well-structured, \nRecruitment Process Overview\nInitial Screening\nTechnical Round 1\nTechnical Round 2\nTechnical Round 3\nInitial Screening\nDuration:\n 5 mins\nMethod:\n Phone\nFocus\n: Skill assessment and resume shortlist via naukri.com\nKey Questions\n: Resume and work-related\nTechnical Round 1\nDuration: \n1.5 hr\nMethod:\n Hire Pro Coding Test\nFocus:\n Aptitude, DSA, Java, Computer fundamentals\nThe first round was a hire pro hiring test that consisted of different sections, Aptitude, Computer fundamentals, language questions, I/O questions and 2 coding questions with each section being timed. I successfully cleared the test, the coding questions were on the easier part.\nTechnical Round 2\nDuration:\n 30-40 min\nMethod:\n In Person Interview\nFocus:\n Java, Computer fundamentals, Resume deep drill\nThe tech interview took place at their Noida office. This mostly comprised of Java language questions, Spring framework and deep drilling my resume. I were able to answer the questions mostly but some questions required knowledge of hibernate which I have hadn't worked upon. Likely, the interviewer was friendly and were happy that I had done my prior projects with deep understanding in various fields including research paper in AI, so she gave me a go green for L2 role.\nTechnical Round 3\nDuration:\n 30-40 min\nMethod\n: In Person Interview\nFocus\n: Java, Java Implementations\nThis round also seemed to be Java focused, where I were required to tell internal working of java security, mongoDB repository and various in depth questions regarding java mongo queries and optimisations, hashset and other java internal working. They also drilled down regarding java transactions which I haven't used. I were good with basics but lacked in depth knowledge how to proceed and scale queries in db, so the interviewer seemed dissatisfied.\nFinal Outcome\nIt was an overall good interview experience but I were rejected.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nNucleus Software Exports Interview Experience  2023 (On-Campus)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nAnonymous\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nExperiences-QnA",
    "source": "GeeksforGeeks",
    "company": "Nucleus Software Exports",
    "role": "SWE II Backend",
    "rounds": [
      "Technical",
      "HR",
      "Coding",
      "Aptitude"
    ],
    "difficulty": "",
    "question_count": 0,
    "raw_questions": [
      "Key Questions"
    ]
  },
  {
    "title": "Capgemini interview experience (2025 - On Campus)",
    "url": "https://www.geeksforgeeks.org/interview-experiences/capgemini-interview-experience-2025-on-campus/",
    "content": "Recently, I had the opportunity to attempt the Capgemini's Exceller on-campus diversity hiring-female only, grabbed the chance, and boom, the interview went something like: (describing every round in detail as below). The interview was well structured.  \nRecruitment Overview Process\nOnline Assessment\nCoding Assessment\nCommunication Assessment\nRound 1: Assessments\nTechnical assessment\n: Had 25 questions; 15 pseudocodes based heavily on finding the output for array, stack, and queue; operations on bitwise and arithmetic operators, post and pre-increment operators (Medium-Hard level). 10 MCQs; all basic questions regarding programming languages and individual DSA theory (Easy peasy).\nEnglish Proficiency Assessment:\n MCQs based on grammar, antonyms and synonyms, and fill in the blank with the correct word tense (Smooth & Easy level).\nCognitive test:\n Including games to play, i.e, puzzles to solve within a time limit (Focus and practice helps!) and 75 curated psychometric questions (Individual responses).\nRound 2: Coding Assessment\nWell, only the top-performing students were able to attempt this round; the rest were moved to the Communication round. Unfortunately, I wasn't one of them. But hey, I qualified for the Spoken English (Communication) round, so yaayy.\nRound 3: Communication Assessment\nConsisted of four sections: read and repeat, hear and repeat, listen to a conversation and answer the questions, and lastly, a topic was given; 30 seconds to think about it and 45 seconds to speak about it, sounds tough right? but actually pretty do-able if you are NOT distracted. Tip is to focus and try remembering because ticking time waited for none and no repetition was allowed. :-(\nRound 4: Technical Interview \nThe interview lasted around 25-30 minutes and the few of the questions were asked as below : \nSelf-Introduction, what is your final year project, projects made over the years, programming languages I feel comfortable with, basics of SQL, difference between primary and foreign key, what is union and union all and their difference, oops concept with example; what are break, continue and pass, concepts of cpp like pointers, friend function and a program to print palindrome numbers in Python. Agile methodologies and describing the models like waterfall, spiral, SDLC and its stages, and a brief questioning for Analytics tools in Google Analytics (I had mentioned Google Analytics in my resume hence the specific question).\nFinal Outcome\nHeads-up, every round was an elimination round. The interview round was focused mostly on resume, make sure you thoroughly go through the resume, every detail mentioned and certifications done should be revised before the interview. Result? I'm waiting, regardless of the outcome whatever it may be; I hope this experience helps! Toodles .\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nCapgemini Interview Experience | On-Campus 2022\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nP\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\npriyadarshag7co\n \n\n\n\n\n\n\n\n\n\n\n\n\n \nFollow\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n2\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nCapgemini\n\n\n\n\n\n\nExperiences-QnA\n\n\n \n\n\n\n\n\n\nPractice Tags : \n\n\n\n\nCapgemini",
    "source": "GeeksforGeeks",
    "company": "Capgemini interview experience (2025 - On Campus)",
    "role": "",
    "rounds": [
      "Online Assessment",
      "Technical",
      "Coding"
    ],
    "difficulty": "Medium",
    "question_count": 3,
    "raw_questions": [
      "MCQs based on grammar, antonyms and synonyms, and fill in the blank with the correct word tense (Smooth & Easy level).",
      "Consisted of four sections: read and repeat, hear and repeat, listen to a conversation and answer the questions, and lastly, a topic was given; 30 seconds to think about it and 45 seconds to speak about it, sounds tough right? but actually pretty do-able if you are NOT distracted. Tip is to focus and try remembering because ticking time waited for none and no repetition was allowed. :-(",
      "Heads-up, every round was an elimination round. The interview round was focused mostly on resume, make sure you thoroughly go through the resume, every detail mentioned and certifications done should be revised before the interview. Result? I'm waiting, regardless of the outcome whatever it may be; I hope this experience helps! Toodles ."
    ]
  },
  {
    "title": "TIAA Interview Experience for Trainee  (On-Campus) 2025",
    "url": "https://www.geeksforgeeks.org/interview-experiences/tiaa-interview-experience-for-trainee-on-campus-2025/",
    "content": "I recently participated in the recruitment process at TIAA for the Software Developer Trainee role. This process included three rounds: an aptitude test, a technical interview, and a managerial round. The experience was insightful, and I’m sharing it here to help others prepare for similar opportunities.\nRecruitment Process Overview:\nAptitude Test\nTechnical Interview\nManagerial Round\nRound 1\n: Aptitude Test\nFirst Round was an Aptitude Test with 2 Coding questions on the CoCubes platform.\nAptitude Section:\n 60 questions (20 each from Logical, Verbal, and Quantitative ability) to be completed in 60 minutes.\nCoding Section:\n Two coding questions of easy to moderate difficulty with a 30-minute time limit. The coding questions were meant to test problem-solving skills in languages like C/C++ and Java.\nI managed to complete the aptitude section with time to spare, and the coding problems were fairly straightforward, allowing me to submit quickly. The faster you submit, the better your chances, so I focused on time management. After completing Part 1 (aptitude), I proceeded to Part 2 (coding) and solved both coding problems. 42 students, including me, were selected from this round.\nThese are easy-level questions. The sooner you submit, the better your chances — time is key.\nRound 2: Technical Interview \n \nThe second round was a Technical Interview that was conducted online on Zoom. This round was purely technical. First, I was asked about my Introduction.\nI was asked to share my screen and write code to explain the core OOP concepts. They also asked me to provide real-life examples demonstrating how these concepts can be related to practical scenarios.\nThey also asked me the differences between Java and C++, why I chose C++ for competitive programming, and the difference between a compiler and an interpreter.\nWhat is Big Data? What is the difference between structured and semi-structured data?\nWhat are microservices? Can you give a real-time example?\nThey gave me some table data and asked me to write SQL queries to retrieve specific information.\nThey also asked me some questions related to DBMS concepts(Joins, Normalization, DDL, DML). and Operating Systems.\nAlso asked about the project I mentioned in my resume. We discussed the technologies used, and the interviewer assessed my depth of understanding of those technologies.\nThey also asked me some questions related to DSA, specifically which data structure is suitable for storing certain types of data.\nThe second round lasted for \n1 hour\n.\nRound 3\n: \nManagerial Round \nThe third round was the Managerial round, conducted online via Zoom for about 30-35 minutes. It was less technical and more focused on behavioral questions and problem-solving. The interview began with an introduction, followed by questions such as:\nIntroduction\nThey asked about my weaknesses and what I do to overcome them.\n Also gave me a puzzle to solve. Although I don’t recall the exact details, I was able to solve it successfully.\nThey asked me what I know about TIAA and why I want to join the company.\nThey also asked me 2-4 standard HR questions, such as ,Where do you see yourself in the next 5 years?\nAt the end, he gave me a chance to ask questions.\nFinal Outcome\nThe next day, I received the result, and I was happy to learn that I had been selected for the role. Three students from my college were chosen in total.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nTata Elxsi Interview Experience (On-Campus) 2023\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nN\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\nnarmadaugale27\n \n\n\n\n\n\n\n\n\n\n\n\n\n \nFollow\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nExperiences\n\n\n\n\n\n\nExperiences-QnA",
    "source": "GeeksforGeeks",
    "company": "TIAA",
    "role": "Trainee  (On-Campus) 2025",
    "rounds": [
      "Technical",
      "HR",
      "Managerial",
      "Coding",
      "Aptitude"
    ],
    "difficulty": "Easy",
    "question_count": 8,
    "raw_questions": [
      "What is Big Data? What is the difference between structured and semi-structured data?",
      "What are microservices? Can you give a real-time example?",
      "They also asked me 2-4 standard HR questions, such as ,Where do you see yourself in the next 5 years?"
    ]
  },
  {
    "title": "PayPal Interview Experience For SDE Summer Internshipz",
    "url": "https://www.geeksforgeeks.org/interview-experiences/paypal-interview-experience-for-sde-summer-internship-2/",
    "content": "Hello everyone! I am an undergraduate student from Rajasthan, India, and I recently had the opportunity to interview with PayPal. The process consisted of multiple rounds that tested my technical skills, problem-solving ability, and behavioural traits. Here’s a brief overview of my experience:\nHow do I receive the Interview Call?\nThe interview opportunity came through an online application, and I was shortlisted after submitting my resume.\nRecruitment Process Overview\nOnline Assessment Round\nTechnical Round\nManagerial Round\nRound 1: Online Assessment Round\nDifficulty:\n Moderate - Hard\nThe OA included 6 MCQs and 1 coding problem. The MCQs were of easy difficulty, covering various topics like OOPS, DBS, and Computer Networks (very basic). The coding problem was a challenging string manipulation problem that required using a priority queue with various constraints. I managed to clear 12 out of 15 test cases. I was the only one shortlisted for the upcoming rounds.\nRound 2: Technical Round\nDifficulty:\n Moderate\nThe technical interview took place about a month after the OA and consisted of 3 coding problems. The first was an easy DP grid problem, which I solved within 10 minutes. The second was another standard DP question (LIS), which I also solved. The third was a hard string manipulation problem that had a unique solution using stacks. I wasn’t required to code the solution. The interview then focused on discussing my projects, followed by related questions. It concluded with an HR question.\nRound 3: Managerial Round\nDifficulty:\n Moderate\nThe managerial interview also took place about a month after the technical interview. It kicked off with a couple of brain-teasers, I was asked 2-3 real-life scenario problems and how I would use unique methods to solve them. These solutions ranged from using DBMS concepts to system interrupts(a debugging feature used in production code). Then, we had an in-depth discussion about React and JavaScript (since I had a project related to it on my resume). The interview ended with a light-hearted discussion about the work location, as I had also lived there.\nFinal Outcome\nHaving a strong resume and solid coding skills is only half of the equation. The other factors include your soft skills, ability to communicate effectively, and sometimes, just a bit of luck. Keep working on these aspects, and success will follow!\nGood luck to all the future candidates!\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nPayPal Interview Experience For SDE summer Internship\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nAnonymous\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nPayPal\n\n\n\n\n\n\nExperiences-QnA\n\n\n \n\n\n\n\n\n\nPractice Tags : \n\n\n\n\nPayPal",
    "source": "GeeksforGeeks",
    "company": "PayPal",
    "role": "SDE Summer Internshipz",
    "rounds": [
      "Online Assessment",
      "Technical",
      "HR",
      "Managerial",
      "Coding"
    ],
    "difficulty": "Hard",
    "question_count": 4,
    "raw_questions": [
      "How do I receive the Interview Call?"
    ]
  },
  {
    "title": "Cognizant Interview Experience for Genc /Genc Pro/Genc Next 2025 - Off-Campus",
    "url": "https://www.geeksforgeeks.org/interview-experiences/cognizant-interview-experience-for-genc-genc-pro-genc-next-2025-off-campus/",
    "content": "This is about my recent interview experience with Cognizant, which was conducted off-campus through the Superset platform in May 2025. The recruitment process was well-structured and consisted of four rounds: a Communication round, an Aptitude + Reasoning (Game-Based) Round, a Technical Assessment, and finally a combined Technical + HR Interview.\nRecruitment Process Overview\nThe Cognizant recruitment process had 4 rounds:\nCommunication Test\nAptitude + Reasoning (Game-Based Assessment)\nTechnical Assessment\nTechnical + HR Interview\nAfter applying via the Superset platform, nearly 1 month later, I got the communication round test link.\nRound 1: Communication Round \nDuration:\n 60 minutes\nMethod:\n Virtual\nFocus:\n English , Fluency, Grammar.\nObstacles:\n In this round , one section consists of an audio which will be played only once and you have to repeat after it. So please be careful.\nAfter 3-4 days , I got test link for aptitude round.\nRound 2: Aptitude Round\nDuration\n: 80 mins\nMethod\n: Virtual\nFocus\n: 30 aptitude questions followed by 4 sections of gamified assessments.\nObstacles\n: In Gamified you should reach maximum level as you can to increase you chances of selection.\nAfter 1 day , I got test link for technical assessment prior to 3 days.\nRound 3:\n Technical Assessment:\nIt consisted of 2 coding(java) , 2 sql , 1 web development (html , css , js ) questions .\nI am very much familiar with c++. But it has only options for Java , python , c#. So I have opted Java.\nI have selected the default cluster which is Java , so I have to do the coding in Java only. \nI solved both coding questions and both sql questions and I solved the html , css part and didn't solve the js part of last question.\nAfter 3 days , I got mail that I was shortlisted for virtual interview.\nRound 4:\n Technical Interview:\nI have been alloted a slot of 4-6 pm . After waiting for long time my interview started  at 5:30pm .\nThe Interviewer asked me to introduce myself. \nI am not much familiar with java coding ( I know only the basics and not much with development, in technical assessment I have solved the questions since they were easy and didn't need any collections to solve).\nSo I introduce myself with my background and mentioned that I am interested towards AI/ML so that I can get questions based on that and also told , I use c++ for problem solving and only java basics.\nHe gave 2 questions to solve : given two arrays, you need to find the common elements . and given a strong which contains a letter twice and you need to find it.\nThese were the easy questions that , I've got since I'm already familiar with easy-medium level questions on GFG with cpp.\nBut , I couldn't even write error free code in java and the same for the second question as well . But I have explained him the logic but he asked me to write the code .\nThen , I asked if I could write in c++ . But he said I want in java only.\nAt that Moment, i knew that it was all over. Then he asked me some OOPS questions and winded it up.\nHe also asked about the Relocation and flexibilty to work in night shifts.\nFinal Outcome\nSo , the technical interview will be purely based on the cluster and the resume. \nI have felt like targeting FAANG to being \nrejected by Cognizant\n, i have came a long way.\nBtw , I am currently working as an intern (6 months) , not a reputed one but.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nCognizant GenC Next Interview Experience | Off-Campus 2021\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nAnonymous\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nCognizant GenC\n\n\n\n\n\n\nCognizant\n\n\n\n\n\n\nExperiences-QnA\n\n\n \n\n\n\n\n\n\nPractice Tags : \n\n\n\n\nCognizant",
    "source": "GeeksforGeeks",
    "company": "Cognizant",
    "role": "Genc",
    "rounds": [
      "Technical",
      "HR",
      "Coding",
      "Aptitude"
    ],
    "difficulty": "Easy",
    "question_count": 6,
    "raw_questions": []
  },
  {
    "title": "My Kota Coaching Experience as a 2022 12th Passout (Covid Batch)",
    "url": "https://www.geeksforgeeks.org/interview-experiences/my-kota-coaching-experience-as-a-2022-12th-passout-covid-batch/",
    "content": "Hey Everyone!\nI just wanted to share my journey preparing for JEE after passing 12th in 2022. My experience was shaped by the impact of the COVID-19 pandemic, which disrupted my learning and preparation.\nThe Impact of the Pandemic\nI was part of the most affected Covid batch — both 11th and 12th were mostly online. Because of this, I didn’t get to meet friends, had no proper guidance from teachers, and honestly, I had no idea what JEE or engineering preparation really meant. Coming from a small town where there's no proper coaching for the JEE. Very few students even attempt the exam here. So by the end of the 12th, I was still clueless about how to start. I had taken PCM, so engineering was the obvious choice — but I didn’t know where or how to prepare.\nDiscovering JEE and Motion Coaching \nOne day, I watched the Kota Factory series, and that’s when I first heard of IIT-JEE. Jeetu Bhaiya’s and NV Sir’s dialogues really hit me. That’s how I found out about NV Sir and \nMotion Coaching Institute.\nJoining Motion Coaching Institute\nMy 12th board exams ended on 13 June 2022. I called Motion for details, and they told me NV Sir would teach 1/3rd of Physics. I was excited and decided to take a drop year. I joined Motion on 22 June.\nThe Initial Phase: Excitement and Enthusiasm\nInitially, it felt good — same subjects (PCM), same enthusiasm. For the first 2 to 2.5 months, the pace was slow, and I was understanding everything. I genuinely felt that I could crack IIT.\nThe Struggles: Fast-Paced Dropper Batch\nHowever, things soon changed. Since it was a dropper batch, the pace picked up significantly. By September, we were studying three chapters simultaneously in each subject — a total of 9 chapters at once. These chapters were taught by different teachers, and the pace felt overwhelming.\nMy batch had around 400 students, which made it difficult to get doubts cleared. Although there were separate doubt-solving faculties, they often used different methods from the class teachers, which only added to the confusion.\nDisappointment with NV Sir’s Limited Involvement\nAnother major disappointment was that NV Sir, who was supposed to teach 1/3rd of Physics, only taught a small part of optics — just the mirror portion. This was quite disappointing, as I had expected more from his classes.\nCoaching Setbacks: Delayed Start and Quality Issues\nThe batch started late (end of June), and proper teaching began only around September. To make matters worse, NTA announced JEE Mains in January instead of April, which meant that by that point, only around 45-50% of the syllabus had been completed.\nAdditionally, Motion shifted all the best teachers to the top \"Star Batch.\" Our batch (a lower one) had mostly less experienced teachers, which significantly affected the quality of preparation. Overall, I would rate my experience at Motion a 3/5. The coaching had potential, but poor planning and miscommunication really let it down.\nTaking Charge: Self-Preparation and Smart Planning\nRealizing that my coaching wasn’t enough, I decided to take control of my preparation. In December, I started studying from PW’s free YouTube batch and created a strict timetable for myself. I listed chapters with deadlines and stuck this plan on my wall. With consistent effort and discipline, I managed to cover almost 70% of the syllabus on my own within a month.\nI focused on solving Previous Year Questions (PYQs), understanding key concepts, and revising regularly. This self-discipline and smart planning helped me immensely.\nThe Outcome: Success at JEE Mains\nThanks to my focused approach, I was able to clear JEE Mains. Today, I’m proud to say that I’m studying at \nIIIT Nagpur\n. This journey taught me the real value of consistency, discipline, and taking control of your own preparation.\nFinal Thoughts\nI hope my journey helps someone make an informed decision about their JEE preparation. While coaching institutes can provide guidance, personal dedication and consistency are what truly matter.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nAllen Coaching Experience of IIT JEE  During Class 11th & 12th\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nN\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\nnikhill004\n \n\n\n\n\n\n\n\n\n\n\n\n\n \nFollow\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nExperiences",
    "source": "GeeksforGeeks",
    "company": "My Kota Coaching Experience as a 2022 12th Passout (Covid Batch)",
    "role": "",
    "rounds": [],
    "difficulty": "Hard",
    "question_count": 0,
    "raw_questions": []
  },
  {
    "title": "Oracle On-Campus Interview Experience for Application Developer",
    "url": "https://www.geeksforgeeks.org/interview-experiences/oracle-on-campus-interview-experience-for-application-developer/",
    "content": "Recently, I appeared for an interview targeting the role of Application Developer. The recruitment process was accurate, well-structured, and included multiple rounds assessing various technical skills and behavioural traits.\nRecruitment Process Overview\nInitial Screening\nTechnical Interview 1\nTechnical 2 + Managerial Interview\nTechnical Interview 3\nHR Interview\nRound:1 Initial Screening\nDuration:\n 90 minutes\nMethod\n: Online Assessment\nFocus:\n 1 hard-level coding question + 20 MCQs (DBMS, OS, aptitude, verbal reasoning)\nKey Questions\nSolve a hard-level DSA problem\nAnswer MCQs from core CS concepts and logical aptitude\nObstacles:\n Managing time between coding and multiple-choice sections\nRound 2: Technical Interview 1\nDuration:\n 1 hour\nMethod: \nIn-person\nFocus: \nDSA, SQL, OOP, JavaScript basics\nKey Questions:\nFix two misplaced nodes in a BST\nBottom view of a binary tree\nCheck if a graph is bipartite\nTree vs Graph logic (Cycle detection)\nSQL: Nth highest salary\nOOP and JavaScript fundamentals (from resume)\nRound 3: Technical 2 + Managerial\nDuration:\n 1 hour\nMethod:\n In-person\nFocus:\n Advanced DSA + problem-solving approach\nKey Questions:\nOne hard-level DSA problem\nAdd constraints progressively and explain design choices\nObstacles:\n Demonstrating adaptability and structured problem-solving under pressure\nRound 4: Technical (Project Discussion)\nDuration: 45 minutes\nMethod: In-person\nFocus: Personal project, edge cases, design logic\nKey Questions:\nDeep dive into project from resume\nHandling edge cases and proposing improvements\nSome were asked to draw ER diagrams and answer DBMS-related questions\nRound 5: HR Round\nDuration: 30 minutes\nMethod: In-person\nFocus: Background, career motivation, communication\nKey Questions:\nWhy software domain\nCareer goals and strengths\nAditional Tips \nPrepare well for HR, ask thoughtful questions at the end, and be confident about what’s listed on your resume.\nFinal Outcome\nThe interview was challenging but insightful. I was selected in between 300+ candidates. The interviewers maintained a friendly and collaborative atmosphere, encouraging open conversations to evaluate my depth of thought and clarity.\nPost-Interview Reflections\nCompany Culture Insights:\nInterviewers were friendly and collaborative, encouraging a conversational tone while evaluating depth of thought and clarity.\nWork Environment:\n Professional and structured; interviews were aligned with real-world software roles.\nBenefits Highlight:\n Standard benefits weren't discussed, but the role offered growth and learning in development-focused areas.\nEvaluator Feedback:\n No formal feedback shared, but steady progression and final selection indicated strong performance.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nOracle Interview Experience | Set 21 (On-Campus for Application Developer)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\narunkumarsuilxk\n \n\n\n\n\n\n\n\n\n\n\n\n\n \nFollow\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nOracle\n\n\n\n\n\n\nExperiences-QnA\n\n\n \n\n\n\n\n\n\nPractice Tags : \n\n\n\n\nOracle",
    "source": "GeeksforGeeks",
    "company": "Oracle On-Campus",
    "role": "Application Developer",
    "rounds": [
      "Online Assessment",
      "Technical",
      "HR",
      "Managerial",
      "Coding",
      "Aptitude"
    ],
    "difficulty": "Hard",
    "question_count": 0,
    "raw_questions": [
      "Key Questions",
      "Key Questions:",
      "SQL: Nth highest salary",
      "Key Questions:",
      "Key Questions:",
      "Key Questions:"
    ]
  },
  {
    "title": "Infosys Interview Experience for System engineer",
    "url": "https://www.geeksforgeeks.org/interview-experiences/infosys-interview-experience-for-system-engineer-1/",
    "content": "I recently participated in the Infosys recruitment process for the role of System Engineer and am happy to share that I was selected. The recruitment was held through a pool-campus, with the results being declared in January 2025. I'm excited about this opportunity and look forward to joining Infosys as a System Engineer.\nRecruitment Process Overview\nThe recruitment process has only two rounds\nWritten Test\nHR/Technical Round\nRound 1: Online Test (Written Assessment)\nThe first round was an online written test comprising 7 sections, including:\nDuration\n: 2 hours\nMode\n: Online\nThe first round was an online written test comprising 7 sections, including:\nAptitude\nLogical Reasoning \nVerbal Ability\nMental Ability\nBasic Programming (5 code snippets)\nPseudocode-based Questions\nEssay Writing\nThere was no negative marking, no sectional timing, and the flow was not unidirectional, which was a great relief. We were informed in the pre-talk that scoring above 75% in each section was crucial to move forward, along with an overall cutoff.\nThe difficulty level was easy to moderate, and overall, I found the test to be manageable without much preparation.\nRound 2: Technical + HR Interview\nDuration\n: 20 minutes\nMode\n: Offline\nDifficulty\n: Easy\nI received the interview call a day after the test, and the interview was scheduled for the next morning at 9 AM. I wasn’t expecting such a quick turnaround, so I had to rush to make it to the venue on time.\nThe interviewer was calm and made me feel comfortable throughout. The interaction covered both technical and HR questions.\nTechnical Questions:\nExplained my Capstone Project in detail\nAsked to write a Palindrome program\nAsked which language I preferred: Java or Python, and why\nHR Questions:\nHave you done any activities other than academics?\nYou've studied in your hometown throughout; will you be able to relocate?\nWhy do you prefer taking up a job instead of going for higher studies?\nDescribe a stressful situation and how you managed it\nWhat’s your opinion on Generative AI?\nHow do you use AI in your daily life?\nSince my resume mentioned\n AI & ML specialization\n, the interviewer asked me about a recent AI trend released the previous day. Unfortunately, I wasn’t aware of it as I hadn’t checked the news. He even tried to give hints, but I couldn’t answer it correctly.\nDespite that, the interview ended on a positive note with a \"Good luck and all the best!\" from the interviewer.\nTips for Future Aspirants\nBe prepared to talk about your projects and resume points in detail\nBrush up on basic coding questions (like palindrome, prime number, etc.)\nStay updated with the latest technology trends, especially if your resume highlights related skills\nBe confident and honest if you don’t know something\nYou don’t need to prepare heavily for the written test – the questions are basic and very doable.\nFinal Verdict\nA few days later, the results were announced, and \nI was selected\n for the \nSystem Engineer\n role at Infosys.\nNote: \nAfter one month, Infosys conducted upgradation interviews for selected candidates. Based on performance and merit, some candidates were offered roles in Digital Specialist Engineer (DSE) and Specialist Programmer (SP) with higher packages. This was a great opportunity for those who performed well to move into more challenging and rewarding roles — \ndefinitely a huge bonus in the overall process!\nWishing everyone the best of luck!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nInfosys Interview Experience For System Engineer\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nAnonymous\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nInfosys\n\n\n\n\n\n\nExperiences-QnA\n\n\n \n\n\n\n\n\n\nPractice Tags : \n\n\n\n\nInfosys",
    "source": "GeeksforGeeks",
    "company": "Infosys",
    "role": "System engineer",
    "rounds": [
      "Technical",
      "HR",
      "Coding",
      "Aptitude"
    ],
    "difficulty": "Hard",
    "question_count": 5,
    "raw_questions": [
      "HR Questions:",
      "Have you done any activities other than academics?",
      "You've studied in your hometown throughout; will you be able to relocate?",
      "Why do you prefer taking up a job instead of going for higher studies?",
      "What’s your opinion on Generative AI?",
      "How do you use AI in your daily life?"
    ]
  },
  {
    "title": "Interview Experience at IIT Kanpur for MS in Signal Processing",
    "url": "https://www.geeksforgeeks.org/interview-experiences/interview-experience-at-iit-kanpur-for-ms-in-signal-processing/",
    "content": "Hello GATE aspirants!\n If you’re aiming for an MS at IIT Kanpur, especially in the Electrical Engineering department with a focus on Signal Processing, here’s a detailed look at the interview process from my experience. I appeared for GATE 2025 in Electronics and Communication, scoring 542 with an All India Rank (AIR) of 2006 in the General category, and was shortlisted among 35 candidates nationwide for this opportunity.\nShortlisting & Interview Call\nBased on my GATE score and rank, I was shortlisted for the MS program in Signal Processing at IIT Kanpur. For context, only 35 candidates were shortlisted from all across India, making the competition very tight. The interview call came via email. The interview was conducted offline with an option for online mode, but I chose to appear physically on campus. This program is well-regarded for its rigorous academic and research standards, making the interview stage a crucial step.\nPreparation for the Interview\nI focused heavily on core signal processing topics, including fundamentals of signals and systems, Fourier and Laplace transforms, and digital signal processing techniques. Additionally, I revised mathematical concepts such as linear algebra, calculus, probability, and statistics, which are important for signal processing theory. I practiced explaining concepts clearly and solving numerical problems. Although I did not have formal mock interviews, rehearsing answers aloud helped me prepare.\nInterview Day Experience\nThe interview lasted about 20 minutes and was conducted by a panel of 2 professors specializing in electrical engineering and signal processing. It started with a brief self-introduction and questions about the subjects I prepared. The questions tested my understanding of linear algebra, probability, and mathematical plotting.\nChoosing to attend the interview physically was motivating. Being on campus allowed me to interact informally with professors and students, observe the academic environment, and learn about ongoing research projects. This exposure gave me a better understanding of the institute’s culture and academic expectations, which helped me mentally prepare for the interview.\nInterview Questions Asked\nHere’s a detailed rundown of the questions I faced:\nBriefly describe yourself.\nWhich subjects did you prepare? (I mentioned Linear Algebra and Probability.)\nExplain linear independence of vectors and orthogonality. They asked how to plot these concepts in vector space and presented various cases on the same plot.\nOn probability, they asked about sigma algebra (which I was not familiar with).\nExplain mutually exclusive and independent events using Venn diagrams. I could explain mutually exclusive well but struggled with independence. They gave an example of dice throw — odd numbers set and divisible by 3 set — and asked me to explain how these are mutually exclusive and independent using Venn diagrams. I explained mutually exclusive properly but got stuck on independent events.\nThen they asked about plotting functions:\nPlot log(1/x) — I took some time but answered.\nPlot 1/(x log(1/x)) and overlap it on log(1/x) — I struggled a bit but managed after repeated attempts.\nPlot sin(x) and sin²(x) in the range 0 to π — I initially drew it correctly it after being asked to take time.\nThe interview lasted around 20 minutes. At the end, I asked for feedback and was told I needed to work more on basics rather than just examples.\nTips for Future Aspirants\nStrengthen your fundamentals in linear algebra, probability, and mathematical concepts rather than relying on examples alone.\nPractice plotting common functions and interpreting their graphs.\nBe prepared to explain concepts like vector spaces, event independence, and sigma algebra clearly.\nRehearse your self-introduction and be ready to discuss your preparation strategy.\nIf possible, attend the interview physically to get a feel for the campus environment and interact with faculty and students.\nStay calm, think aloud during problem-solving, and listen carefully to hints from the interviewers.\nConclusion\nThe IIT Kanpur MS interview in Signal Processing was concise but probing, focusing on core mathematics and conceptual clarity. For those preparing, focus on basics, practice graphical questions, and communicate your thought process clearly. Visiting the campus physically gave me motivation and valuable insight into the institute’s research culture. Feel free to reach out if you want to discuss the interview or preparation strategies in more detail!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nWipro Interview Experience for SIM 2022\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nK\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\nkushagra5r76\n \n\n\n\n\n\n\n\n\n\n\n\n\n \nFollow\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nExperiences",
    "source": "GeeksforGeeks",
    "company": "",
    "role": "MS in Signal Processing",
    "rounds": [],
    "difficulty": "",
    "question_count": 1,
    "raw_questions": [
      "Which subjects did you prepare? (I mentioned Linear Algebra and Probability.)"
    ]
  },
  {
    "title": "Unlock Strategies To Memorize Vast GATE Syllabus",
    "url": "https://www.geeksforgeeks.org/interview-experiences/unlock-strategies-to-memorize-vast-gate-syllabus/",
    "content": "Are you struggling to cover your entire GATE syllabus like other aspirants? No need to stress out! We've got a secret strategy that every GATE aspirant should incorporate into their preparation journey. By following our mentioned approach, even the vast and challenging syllabus will become interesting and manageable to all aspiring candidates.\nWe often hear that many GATE aspirants fail to clear the examination. Have you ever wondered what the reason is behind it? It is not because of their lack of knowledge regarding the subjects but because they are unable to cover the entire GATE syllabus on time.  The GATE CSE paper consists of 12 subjects, right from General Aptitude to Data Structures and Algorithms. Each subject comprises 10-12 subtopics, and covering all 12 subjects, along with managing revision and test series, seems nearly impossible for many aspirants.\nIf you are among those candidates who are going to appear for the upcoming GATE examination, then you have landed at the right place. In today's article, let us explore strategies that may aid aspirants in memorizing the vast syllabus.\nFocus on Fundamentals\nA strong foundation is crucial in your GATE preparation. Starting with a structured approach is essential. Begin by mastering the fundamentals of each subject. Here’s how you can do that:\nStart with One Topic at a Time:\n Focus on individual subjects and complete one topic before moving on to the next. This ensures that you don’t feel overwhelmed.\nPrepare Notes:\n While studying a topic, take notes and immerse yourself in its theory and concepts. Once you are confident with a topic, move on to solving previous year’s questions (PYQs) to solidify your understanding.\nRepeat the Process:\n Once you complete one topic, move on to the next, solve its PYQs, and repeat the cycle until you cover all topics.\nThe key is to \nmaster one topic before moving to the next\n, which will help you stay organized and ensure a strong grasp of concepts.\nComplete the Syllabus 4 Months Before the Exam\nOnce you are done with covering the entire syllabus beforehand, dedicate the remaining 4-5 months to revising all your concepts. Adopt the revision cycle formula to ensure that you have sufficient time in hand for in-depth understanding and revising your weak points. Make a target to complete your first revision cycle within a week by creating the subnotes (ensure to limit them to 3-4 pages only), which serve as a quick reference for revisiting the concepts a day before the exam and then solving the previously solved PYQs again. When done, go for the unsolved PYQs.\nImplement the Revision Cycle Formula\nOnce you’ve completed the entire syllabus, use the remaining 4-5 months for \ndedicated revision\n. Adopting the \nRevision Cycle Formula\n will help you revise efficiently and ensure you’re well-prepared for the exam.\nFirst Revision:\n Target to complete your first revision cycle within a week. Create \nconcise sub-notes\n (limit them to 3-4 pages per topic), which serve as quick reference material for last-minute revision.\nPYQs:\n After completing the first revision, solve the previously solved PYQs again. Once done, move on to the unsolved PYQs to test your retention.\nRepeat the Cycle:\n Repeat this process for 3 months. By the end of this cycle, you will have covered around 90% of the PYQs across all topics.\nThis continuous revision approach will help you internalize the concepts and increase your chances of success in the GATE exam.\nThe Importance of Test Series\nThe last two months before the GATE exam are important for refining your strategy. Dedicate these two months completely to \ntaking test series\n. Here’s why:\nFamiliarity with Question Pattern:\n Regularly taking test series helps you become familiar with the GATE exam format, time limits, and the types of questions asked.\nTime Management:\n It sharpens your time management skills, ensuring you can solve questions within the given time.\nUnderstanding the Question:\n Many aspirants stress over scoring high marks without properly understanding the questions. It’s important to read each question 2-3 times before attempting to solve it. Quality over quantity is key.\nIdentify Weak Areas:\n Test series help identify your strengths and weaknesses, allowing you to focus on areas that need improvement.\nThe more tests you take, the better prepared you’ll be. This strategy ensures that you’re not just memorizing answers but truly understanding the material.\nWhat to do now? - Let’s Conclude\nNow, there is no need to panic on seeing the vast GATE syllabus. Include the above hacks and re-revise your preparation strategy accordingly to ensure the entire syllabus coverage and revision on time before appearing for the examination. Get one step closer to excelling in the upcoming GATE examination. \nGood luck with your preparation!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nMy Journey of GATE Exam Preparation\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\nakshitasharma0212\n \n\n\n\n\n\n\n\n\n\n\n\n\n \nFollow\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nExperiences\n\n\n\n\n\n\nCompetitve Exam Experiences",
    "source": "GeeksforGeeks",
    "company": "Unlock Strategies To Memorize Vast GATE Syllabus",
    "role": "",
    "rounds": [
      "Aptitude"
    ],
    "difficulty": "",
    "question_count": 11,
    "raw_questions": [
      "Are you struggling to cover your entire GATE syllabus like other aspirants? No need to stress out! We've got a secret strategy that every GATE aspirant should incorporate into their preparation journey. By following our mentioned approach, even the vast and challenging syllabus will become interesting and manageable to all aspiring candidates.",
      "We often hear that many GATE aspirants fail to clear the examination. Have you ever wondered what the reason is behind it? It is not because of their lack of knowledge regarding the subjects but because they are unable to cover the entire GATE syllabus on time.  The GATE CSE paper consists of 12 subjects, right from General Aptitude to Data Structures and Algorithms. Each subject comprises 10-12 subtopics, and covering all 12 subjects, along with managing revision and test series, seems nearly impossible for many aspirants.",
      "PYQs:",
      "What to do now? - Let’s Conclude"
    ]
  },
  {
    "title": "TCS Interview Experience for Ninja Role (Verdict : Selected)",
    "url": "https://www.geeksforgeeks.org/interview-experiences/tcs-interview-experience-for-ninja-role-verdict-selected/",
    "content": "I applied for a position in November 2024, and the process turned out to be an interesting and enriching experience. Here's a breakdown of the journey:\nEligibility Criteria:\nFinal-year student seeking thesis/internship opportunities.\nAcademic background with strong foundational knowledge (0–1 years relevant academic experience).\nRecruitment Process Overview:\nInitial Screening\nTechnical Round\nHR Round\nRound 1: Initial Screening\nDuration:\n Around 2–3 hours (online/offline exam center)\nMethod:\n In-person (exam center)\nFocus:\n Aptitude and Data Structures & Algorithms test (TCS format)\nKey Questions:\nQuantitative aptitude (math problems, logical reasoning)\nDSA coding and logic problems\nObstacles:\n Time pressure during the exam, balancing aptitude and coding questions\nRound 2: Technical Round\nDuration:\n Approximately 40–45 minutes\nMethod\n: In-person (on-campus)\nFocus:\n Data Structures and Algorithms, CS fundamentals (OOPs, DBMS), logic puzzles\nKey Questions:\nSwap two numbers without using a third variable, STL, or XOR → Required to find alternate method (addition/subtraction approach)\nPrint numbers in a given range that divide a number a\nPuzzle:\n \"If 5 machines make 5 pens in 5 minutes, how long will 100 machines take to make 100 pens?\"\nPuzzle:\n \"Bird lands on a 50kg car on a 50kg limit bridge – will it still cross?\"\nPuzzle:\n \"How to divide a cake into 8 pieces using 3 straight cuts?\"\nOOPs:\n Abstraction, encapsulation, inheritance, constructor overloading, method overloading vs. overriding, static vs. dynamic binding\nDBMS:\n 3-level view architecture, primary key vs. unique key, SQL JOIN query\nSome Java-related OOPs questions (despite C++ background)\nObstacles:\nUnexpected twist on the swap question (had to come up with a 4th approach)\nSome Java-specific OOPs questions despite primary focus on C++\nOne puzzle was difficult to recall, but I attempted a logical answer nonetheless\nRound 3:\n HR Round\nDuration\n: 10–15 minutes\nMethod\n: In-person\nFocus\n: Behavioral and situational judgement\nKey Questions:\nHave you faced any conflict in a team? How did you handle it?\nWhat if someone in your team refuses to work?\nIf there’s a bug in the final product, would you inform the client?\nAre you willing to relocate?\nObstacles:\n None — The HR round was conversational and relaxed.\nPost-Interview Reflections\nCompany Culture Insights:\n Friendly and problem-solving focused. The interviewers encouraged thinking aloud and appreciated logical problem-solving.\nWork Environment\n: Conducted on campus, so no direct insight into company environment, but interviewers seemed supportive and professional.\nBenefits Highlight:\n Not discussed during this process.\nEvaluator Feedback: \nPositive overall. The interviewers seemed to value my honesty and ability to think on the spot, which helped me get selected.\nSuggestions for Improvement: \nIt would be helpful if candidates were given clearer info about expected languages or topics to better prepare for language-specific questions.\nAdditional Information\nThe exam and interview were conducted smoothly and results were shared quickly. I was selected, which was a big confidence booster.\nFinal Outcome\nI was selected.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nTCS Interview Experience Ninja Role FTE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nS\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\nsrivastavakhushi\n \n\n\n\n\n\n\n\n\n\n\n\n\n \nFollow\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n3\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nExperiences\n\n\n\n\n\n\nTCS-Ninja\n\n\n\n\n\n\nExperiences-QnA",
    "source": "GeeksforGeeks",
    "company": "TCS",
    "role": "Ninja Role (Verdict",
    "rounds": [
      "Technical",
      "HR",
      "Coding",
      "Aptitude"
    ],
    "difficulty": "Hard",
    "question_count": 8,
    "raw_questions": [
      "Key Questions:",
      "Quantitative aptitude (math problems, logical reasoning)",
      "Key Questions:",
      "\"If 5 machines make 5 pens in 5 minutes, how long will 100 machines take to make 100 pens?\"",
      "\"Bird lands on a 50kg car on a 50kg limit bridge – will it still cross?\"",
      "\"How to divide a cake into 8 pieces using 3 straight cuts?\"",
      "Key Questions:",
      "Have you faced any conflict in a team? How did you handle it?",
      "What if someone in your team refuses to work?",
      "If there’s a bug in the final product, would you inform the client?",
      "Are you willing to relocate?"
    ]
  },
  {
    "title": "TCS Prime Interview Experience | Off-Campus 2024",
    "url": "https://www.geeksforgeeks.org/interview-experiences/tcs-prime-interview-experience-off-campus-2024-drive/",
    "content": "Tata Consultancy Services (TCS) is one of the leading global IT services, consulting, and business solutions organisations. TCS offers various hiring roles, such as Ninja, Digital, and Prime, based on the performance in the TCS National Qualifier Test (NQT). The Prime role is offered to candidates with strong technical and problem-solving skills.\nHow I Got the Opportunity\nI applied through the \nTCS NQT 2024 Off-Campus Drive\n, which was held in April 2024. This is a yearly drive open to all final-year students across India.\nRecruitment Overview Process\nTCS NQT Exam\nInterview (TR + MR + HR Combined)\nRound 1: TCS NQT Exam\nThe TCS NQT exam had the following structure:\nAptitude Section:\n Verbal Reasoning, Quantitative Aptitude, Logical Reasoning\nCoding Section (2 Questions):\nFind the sum of cubes from 1 to a given number n.\nGiven a list of products with price and quantity sold, we had to:\nCalculate total sales\nFind the average sales\nIdentify the best-selling product\nThe logic wasn’t hard, but the input format was a bit tricky, and many faced issues viewing the output. There was a small arrow we had to click to see the printed output, even I discovered it around 15 minutes before time ended, but managed to submit it successfully.\nAfter clearing NQT, I received a mail for the interview (Prime role).\nRound 2: Interview (TR + MR + HR Combined)\nThe panel had three interviewers – technical, managerial, and HR.\nStarted with a brief introduction and questions about my family background.\nProject Discussion:\nWhat is your project about?\nIs it live? – Since I had added the project link in my resume, I showed them the hosted application on one of the interviewer's mobile phones.\nWhat was your role in project?\nWhat’s new in your project compared to existing ones?\nWhat is JWT token used in your application?\nThey seemed quite interested in the live demo and asked follow-up questions based on what they saw.\nTechnical Questions:\nDifference between final and finally\nException handling\nData types and data structures\nWhat is a binary tree?\n4 pillars of OOP\nDifference between DML and DDL\nTypes of locks in DBMS\nCoding Question:\nSwap two numbers without using a third variable. \nThe question was easy, but the panel asked me to explain multiple approaches to solve it.\nThey were mainly checking problem-solving skills, how I think through multiple solutions, and my understanding of the logic behind it.\nManagerial Questions:\nWhat do you know about TCS?\nWhy do you want to join TCS?\nWould you work on old technologies if required?\nWould you prefer:\nWorking alone on a latest tech project, or\nWorking in a team on a smaller project?\nCloud & Tech Awareness:\nWhat is Cloud Computing? What are its types?\nDifference between Public, Private, and Hybrid Cloud\nExplain IaaS, PaaS, and SaaS with examples\nHR Questions:\nYour strengths and weaknesses\nYour 10th, 12th, and graduation percentages\nAny backlogs or education gaps\nWilling to relocate?\nDo you have any questions for Dus?\nFinal Outcome\nSelected for Prime Role.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Comment\n    \nMore info\nAdvertise with us\n \n\n\n\n\nNext Article\n\n\n\n\n\n\n\n\n\n\nTCS Interview Experience (Off-Campus) 2021\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nAnonymous\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImprove\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArticle Tags : \n\n\n\n\n\n\nInterview Experiences\n\n\n\n\n\n\nTCS\n\n\n\n\n\n\nExperiences-QnA\n\n\n \n\n\n\n\n\n\nPractice Tags : \n\n\n\n\nTCS",
    "source": "GeeksforGeeks",
    "company": "TCS Prime",
    "role": "",
    "rounds": [
      "Technical",
      "HR",
      "Managerial",
      "Coding",
      "Aptitude"
    ],
    "difficulty": "Hard",
    "question_count": 15,
    "raw_questions": [
      "What is your project about?",
      "Is it live? – Since I had added the project link in my resume, I showed them the hosted application on one of the interviewer's mobile phones.",
      "What was your role in project?",
      "What’s new in your project compared to existing ones?",
      "What is JWT token used in your application?",
      "What is a binary tree?",
      "What do you know about TCS?",
      "Why do you want to join TCS?",
      "Would you work on old technologies if required?",
      "Working in a team on a smaller project?",
      "What is Cloud Computing? What are its types?",
      "HR Questions:",
      "Willing to relocate?",
      "Do you have any questions for Dus?"
    ]
  },
  {
    "title": "LoginNext Interview Experience for software Engineer",
    "content": "it was a good experience",
    "source": "User"
  },
  {
    "title": "LoginNext Interview Experience for software Engineer",
    "content": "it was good",
    "source": "User"
  },
  {
    "title": "LoginNext Interview Experience for software Engineer",
    "content": "fdmgkjfgdgnjdsl",
    "source": "User"
  }
]